{
	"alienDescriptions": ["The Abednedo are a common sentient species native to the planet of the same name. Abednedos are tall humanoids with mouth tendrils, long faces and widely spaced fleshy nostrils; often brown or tan in skin colour.",
		"The Abyssin inhabit the planet Byss. They are a nomadic race, often described as brutish and violent. They stand approximately two meters tall and have a humanoid appearance, with long limbs and weathered skin. They also possess a single large slit-pupiled eye which dominates their greenish-tan foreheads. Abyssins do not take kindly to derogatory nicknames regarding their eye, such as monoc, one-eye or cyclops. They are quick to anger, especially when taunted or insulted. They are known to look for conflict and rarely show restraint. All Abyssins have the ability to heal quickly and to regenerate body parts, which leads to their belief that change is impossible, and as such they rarely stray from their home world.",
		"The Aleena are a short-bodied alien race native to the planet Aleen. They are characterized by their thick bodies and short limbs. They waddle when they walk, and are ungainly to look upon. Their heads are dominated by a long, thin plate of body which extends back from the skull, and their faces are flat. Two small eyes sit over a wide mouth which is filled with short, sharp teeth. Aleena are known for their quick-change metabolism, which helps them escape from sagcatchers on their home-world. Individuals are bred for their color variation, another way they avoid becoming prey. As a people, the Aleena have a strong warrior tradition. They possess exceptional reflexes as well as a fast metabolism which allows them to convert food into energy very rapidly in order to escape predators on their harsh home planet.",
		"The Amanin, nicknamed Amanaman in some regions, are large aliens descended from planarian worms. They have long arms and a broad body, and their heads resemble that of a hooded cobra, but with a humanoid face. They hail from Maridun, where they prefer to travel in the trees, using their arms to swing among branches, but their shapes also allow them to curl into a ball and roll at incredible speeds. They organize into small tribes that form war with good chiss parties to fight the other tribes for territory. They do not use technology and prefer to fight with spears and arrows, but they are vicious fighters and are galaxy-renowned for it. This reputation grew when they wiped out an entire stormtrooper division that had set up on their home planet. During and after the rule of the Empire, they sold their POWs into slavery. They are also popular as guards and bodyguards with the criminal elements of the galaxy. The Hutts are the biggest users of their services.",
		"Amarans were fox-like sentients from the planet Amar. They also are in to animal trade. Otherwise, there isn't much more information on them.",
		"The Annoo dat prime is a four eyed, reptilian race hailing from the planet Annoo. The average height for an Annoo dat prime male is 6 and one half feet, while females are half a foot shorter on average. The Annoo dat prime tend to have rough, yellow scaled skin, with a small row of spines running down their backs and to the end of their short tails. Annoo dat prime have four eyes, the upper two red and the lower two blue.",
		"Anomid are humanoid, with grey hair and silver-blue eyes, and are native to the Yablari system. They communicate largely using their own sign language. They are reportedly one of the more social species in the galaxy.",
		"Ansionians are tall and thin. In addition to possessing only one nostril, they have relatively large eyes. The Ansionians hail from the planet of Ansion, and are known to be lovers of peace. Many Ansionians, called Alwari, live in tribal factions on the plains, away from the human settler-created cities. They are relatively nomadic and resent technology because of the fact that it has ruined the face of their planet.",
		"The Anx are large saurian aliens from the planet Gravlex Med. They are typically four meters tall and have long, thick tails as well as beard-like facial protuberances which give them a wizened look. Atop their heads are large crests, giving them a Parasaurolophus- like appearance.",
		"The Anzati appear similar to humans, the only differences being two prehensile probosci and a somewhat enlarged nose. People of their species are rare, but they have an impressive lifespan that can last for over a millennium. They tend to behave like vampires. The proboscises lie coiled and hidden in pockets within the cheeks and can be extended to drain a victim's 'luck' or 'soup' by piercing the brain through the nose. The Anzati are capable of mild telepathic control to render their victims paralyzed, and are assassins of legendary skill. Their planet of origin has never been verified, as all sent to investigate the planet suspected to be Anzat are never seen again.",
		"The Aqualish have a reputation for being nasty, crude and aggressive, and generally pursue careers as mercenaries, bounty hunters and pirates. The Aqualish are divided into three different subspecies, the Aquala, the Ualaq and the Quara; these subspecies are differentiated by their hand structure (the Aquala have large, finlike hands, while the Quara and the Ualaq possess five-fingers with clawed digits) and facial appearance (the Ualaq have four eyes and bear some resemblance to Earth spiders, while the Aquala and the Quara have two eyes and more closely resemble a walrus). The Aqualish hail from the planet Ando. Their home planet is almost entirely covered by water; the only hospitable land consists of a few rocky outcroppings and swamp-covered islands.",
		"A strange species, Arcona are scaleless, reptilian humanoids. They have flat, anvil-shaped heads, with clear, marble-like eyes, and skin tone that ranges from mahogany to ebony. The native planet of the Arcona, Cona, is always hot, and has very little water. The atmosphere is filled with ammonia vapor. The Arcona's weaknesses have been exploited in the past; off-worlders used to trade water for mineral rights, but discovered their easy addiction to salt. Traders then imported large amounts of the mineral before communities outlawed the dealings. When the species has become addicted to salt, their eyes turn from green to gold. To survive an Arconan must periodically consume a substance known as dactyl. Salt increases an Arconan's need for this substance by a hundredfold.",
		"Argazdans were a green-skinned humanoid species native to the planet Argazda. There is not much other information on them.",
		"The Arkanian are a near-human people with extreme intelligence. They enslaved the Yaka from nearby planets, turning them into cyborgs. Their home planet, Arkania, is not truly their homeworld at all, but was originally a repository for Sith knowledge. Arkanians have three fingers and a thumb on each hand, and can see well into the infrared range of the electromagnetic spectrum.",
		"Aruzans, the inhabitants of Aruza, are humanoids with faintly blue skin and dark, nearly black hair. They have the ability to share their memories and emotions with one another by means of cybernetic implants.",
		"The Askajian appear to be bulky, flabby creatures and are often dismissed as such. The bulk is actually stored water, a genetic trait acquired from evolving on a desert planet. When needed, the Askajian can draw on this water to survive, in which case they become dramatically thinner as the stored water is used up. Askajian tend to have multiple children per pregnancy, and thus as an evolutionary trait females of the species have three sets of breasts.",
		"The Balosar were noted for the retractable antenepalps atop their heads. Native to a planet also known as Balosar, they were generally regarded as shifty cheaters and scoundrels by other races. This is most likely derived from the fact that they produce and sell death sticks, addictive and eventually fatal drugs distilled from balo mushrooms, which are farmed in large quantities underground. As a people, the Balosar seemed to be content to allow their homeworld to be overrun by offworld corporations and criminal syndicates, taking bribes and other payments in return for land grants or other rights. The lowest classes of Balosar were paid poorly for their work in sweatshops and factories, despite the best efforts of the Old Republic.",
		"The Bando Gora are the Star Wars version of the living dead. These souls of ancient warriors were brought back by the dark Jedi Komari Vosa. They are found all over the galaxy, but originated on one of the moons of Bogden. These beings appear as dark, humanoid creatures, wrapped in black. They answer only to their master. The Bando Gora were the personal army of Vosa, and she used them in crippling attacks on some of the galaxy's top industries. In the end, the Bando Gora, along with Vosa, were destroyed by Jango Fett.",
		"The Barabel are a reptilian species that appears human, save for the scales covering their bodies and long tails. They are extremely strong and have long pointed teeth. They are one of the most feared aliens in the galaxy. They will eat almost any kind of meat providing it is or was recently alive. They take great thrill in hunting for their food. However, they show an immense amount of respect to the Jedi, and seem to value their wisdom above all else. This is because in their distant history, a wandering Jedi had settled a bloody dispute between two major clans over prime hunting grounds.",
		"Besalisks are a race of four-armed humanoids from the icy planet of Ojom, though female Besalisks can have up to eight arms. Besalisks evolved from large flightless avians, though they are often mistaken for a reptilian species. They are bulky, fleshy beings able to survive for long periods without food or water. They tend to have a bony crest surrounded by short feathers, and a wide mouth with an elastic sack dangling from it. Because of their size, they are often seen as gluttonous, though this is a misconception. Another misconception is that they are nervous or in poor shape because they sweat profusely, though this is in fact due to the normally freezing temperatures on their home planet. The average Besalisk stands approximately 1.8 meters tall. Their language consists of grunts, growls, and barks, and their written language has a simple alphabet and short words, although Besalisks can speak Galactic Basic with ease.",
		"The Bimm actually exist as two separate species. The member of the first species are super-intelligent peaceful humanoids natives from planet Bimmisaari. They are fond of the color yellow, and often clad themselves in garb of this color. The second species is short and covered in fur with floppy-ears and is also super-intelligent. The two species live side by side on the same planet, and refer to all members native to the planet as Bimms.",
		"Bith are native to the planet Clak'Dor VII. They have pale skin, large heads and eyes, and long fingers. Their mouths are hidden within three folds of moist skin, and their ears are capable of hearing frequencies far beyond those that most species can perceive. In some cases, Bith have been known to hear high-powered communication broadcast signals without using artificial equipment. Due to their highly tuned audio senses, Bith are often sought after as musicians across the galaxy. They also have great reputations as starship mechanics and scientists. Bith are also able to store large amounts of information in a very short period of time and retain that information in an undamaged binary state for short periods of time. They are considered mature at ten years of age and are known for long life.",
		"The Blarina are an alien race introduced in the 2015 novelization of Star Wars: The Force Awakens by Alan Dean Foster. In the novel, X-wing fighter pilot Poe Dameron, stranded on the desert planet Jakku, is aided by the Blarina scavenger Naka Iit. Naka is described as being humanoid but scaly, a little more than half the height of a human, with a short, wide snout and gold-hued, slitted eyes. He has claws and sharp teeth, and more teeth than humans have. Poe notes that the Blarina are 'not especially strong, but ... very, very quick'.",
		"Blood Carvers are thin humanoids, golden in skin color, with three jointed arms and legs. Their nose is two separate flaps that contain both the senses of smell and of hearing. Their society hates the idea of wealth and money and sees little to no use for it, basing their hierarchy on honor rather than money.",
		"Boltrunians are a large and muscular reptilian near-human species with hairless heads, craggy faces, wide noses, and heavy brow ridges. Boltrunians could live to be over 700 years old.",
		"Bothans hail from the industrial Mid Rim planet of Bothawui, though they also populate various colony worlds like Kothlis and Torolis. Most Bothans stand about 5–6 ft. tall. They have tapered pointed ears, elongated heads, and a very few from both sexes have beards. They are manipulative, crafty, suspicious, curious by nature, loyal, brave, and very smart. They developed their technology to travel among the stars millennia ago and are longstanding members of the galactic civilization.",
		"Bouncers are furry green floating orbs with thin black tails that live on the planet Ruusan. Bouncers apparently move with the wind, lifting flaps of skin to use them as sails to guide their bodies. They use rocks and other formations to bounce them high, gliding them through the air for travel. Bouncers are said to be attuned with the Force and can communicate with those who can manipulate it. They can also become hostile when exposed to massive amounts of energy from the dark side of the Force. They communicate with other species by speaking into their minds. They can also attempt to predict the future.",
		"The Caamasi are a species of golden-furred humanoids known for their calm wisdom and pacifist nature. Strongly loyal to the Old Republic, many Caamasi died when their homeworld of Caamas was devastated by the Galactic Empire.",
		"The Cathar are cat-like humanoids from the planet Cathar. While they appear in various Star Wars media, there isn't much information about them.",
		"The Celegians are a species of intelligent scyphozoans native to Celegia, appearing as floating brains trailing a cluster of prehensile tentacles. The species are renowned for their wisdom and intellect, and they often travel far seeking to expand their knowledge. Celegians evolved from ocean-dwelling ancestors, and developed a natural form of levitation similar to an organic repulsorlift generator. Their homeworld has a cyanogen atmosphere, which is lethal to most species but necessary for the Celegains, for whom oxygen is toxic. Because of this, when they travel offworld, they are normally encased in a chamber filled with cyanogen; this causes them appear as if afloat in a watery brine. Because of their fragile form and life support requirements, they are rarely encountered.",
		"Cereans are a species with long cone-like heads that hail from the planet Cerea. Their heads are long due to having an extra heart on top of their brain. They have a very low number of males compared to females. Cereans sport binary brains within their large heads, and although their coordination is generally somewhat impaired relative to humans or other species, they make up for it with incredible mind control and thought processes.",
		"The Chadra-Fan are short, furry mammalianoids with bat-like faces and flap-like ears. They live in the swamps and marshes of their native planet Chad. They are renowned for their weak strength, emphasized by the saying 'You punch like a Chadra-Fan.'",
		"The Chalactan was a near-human race native to Chalacta. Not much else is known about them.",
		"Chagrians are blue skinned humanoids with horns and lethorns. The Chagrian homeworld's twin suns produce vast amounts of radiation that would kill a normal human. Therefore, Chagrians have evolved their blue skins to filter the radiation.",
		"The Chazrach are a short, stocky, reptilian humanoid race with snubbed snouts that serve the Yuuzhan Vong as slave soldiers. They are also called reptoids by the inhabitants of the galaxy. They are one of the few species other than the Yuuzhan Vong that are not native to the galaxy. They were formerly a free people, but were enslaved during the Yuuzhan Vong's plundering of their own galaxy.",
		"The Chiss are a humanoid species with pale blue skin, blue-black hair, and glowing red eyes. Csilla is identified as the homeworld of the Chiss. Csilla is a cold world of glaciers and snowy wastes located deep within Chiss Space, and serves as the capital of the Chiss Empire. The Chiss are noted for their lack of droids, or any kind of artificial intelligence. While their history has been marked by nearly continual warfare and conquest of other worlds, the Chiss are generally not personally violent: indeed, one of the major laws of their society (the breaking of which resulted in Thrawn's exile from their space) is that the Chiss cannot launch preemptive attacks, even against obvious aggressors.",
		"The Chistori are a lizard-type humanoid race. They resemble bipedal lizards with a prominent muzzle, an impressive line of teeth, and thick scales. Few things are known in connection with the reptilians known as the Chistori because they are a secretive race. Even the Jedi Files do not know their native world. Due to their reptilian nature, they are cold blooded. If a Chistori is exposed to cold temperatures for a prolonged period of time they will undoubtedly die.",
		"Clawdites are a genetic offspring from Zolanders, the dominant species on planet Zolan. When Zolanders discovered that their sun had increased its radioactive emissions, they tried to unleash a gene in the Zolander skin cells to activate natural protection against radiation. The results created a new species, Clawdites, which were metamorphs. Clawdites can change their appearance, if keeping body mass as a constant and not retaining the same aspect for a long time. Zolanders ostracized Clawdites and they had many civil wars, but in the end, Clawdites subjugated Zolanders. The Clawdites then joined the New Republic as part of the Guile Company, a group of Clawdites with advanced shapeshifting skills.",
		"Codru-Ji are four-armed humanoids with pointed ears who, while not xenophobic in the typical sense, have not yet integrated themselves into galactic society. They guard their society and their young with equal ferocity, which can be surprising since an immature Codru-Ji appears almost nothing like a mature Codru-Ji, and in fact can be mistaken for a pet. Immature Codru-Ji, also known as Wyrwulf, are small, six-limbed lupine creatures who enter a chrysalis phase in puberty and emerge a mature Codru-Ji.",
		"The Coway are a fur-covered humanoid species that are native to the planet Mimban, of the Circarpous Major System. Coways live deep underground, and have a strong aversion to surface-dwellers. Coways have small eyes, but are able to see in the dark due to their infrared vision. Additionally, they are able to eat foods normally poisonous to humans because of their more tolerant digestive system. They wear simple, primitive clothing.",
		"The Croke are a very small species, so much so, that they can be held in a person's hand. They also have a reputation for being unpleasant and evil. They are humanoid creatures, and range from 4 inches to 5 inches (100 to 130 mm) in height although occasionally a Croke will be 6 inches (150 mm) tall. They also vary greatly in weight from 5 oz to 32 oz (140 g to 910 g). Average weight for a Croke is 10 oz (280 g). They have natural powers of illusion and shapeshifting. Their home-world is Crakull.",
		"Dantari are a race of hard-skinned Neanderthal-like humanoids. They hail from the planet of Dantooine, and are relatively primitive. Dantari see technologically supreme beings as gods, and have since tattooed themselves with pictures of AT-ATs, stormtrooper helmets, and, for the bravest of Dantari, full-body depictions of stormtrooper armor.",
		"Dashades are tall, humanoid reptiles with dark skin. They are powerful warriors and assassins, and they are not affected by the powers of the Force. Their planet, Urkupp, was destroyed in a supernova caused during the Great Sith War, killing all of the Dashades on the planet. New Republic historians have found evidence that Dashade mercenaries may have been employed during the great purge of the Jedi order that accompanied the rise of the Galactic Empire. And perhaps Dashade colonies still exist, founded before the destruction of Urkupp, still waiting to be discovered.",
		"Dathomirians are humanoid beings who reside on the planet Dathomir. The female Dathomirians are all members of the Nightsister Clan, a group that employs various powers derived from the dark side of the Force. The Nightsisters control the force through the use of spells. They also rule over the Nightbrothers, a group of Zabrak whom they employ as assassins and mates. The clan was largely wiped out by the Separatists on the orders of the Sith due to their previous attempts on the life of Count Dooku.",
		"The Defel are barely visible beings who appear to most other species as shadows, re-enforcing the misconception that they are chameleon-like beings or living shadows. Often called wraiths, their bodies absorb visible light, giving them the appearance of shadows. Typically, they are employed as mercenaries or guards. They are from a large, high-gravity, seldom-visited world orbiting the ultra-violet supergiant Ka'Dedus called Af'El. Af'El has no ozone layer and ultra-violet light passes freely to the surface, while other light wavelengths are blocked by the heavy gases in the planet's atmosphere. Thus, all life forms on Af'El can only see in ultra-violet light ranges, and are blind to other wavelengths of light. Defels must wear special visors when exposed to normal wavelengths of light, or else they are effectively blind. In ultra-violet light, they appear as short, muscular lupine humanoids with thick fur and unusual, three-jointed fingers. The Defel live in underground cities to escape Af'El's violent storms and to mine the various metals in the planet's crust and outer core. A main export of the planet is the metal meleenium (used in durasteel), which is only known to exist on Af'El.",
		"Devaronians are a horned humanoid species from the world of Devaron in the Expansion Region, a planet of low mountains and deep valleys linked by thousands of rivers. It is believed that they are descended from a race of primates that lived in the mountains of Devaron, and that their horns were a genetic mutation that proved useful in fending off predatory birds. The Devaronians are one of the unique races in the galaxy, as their male and female sexes are so vastly different in appearance and temperament. The males are aggressive by nature, hairless, with red-tinted skin and a pair of large horns growing from their heads. They take great pride in their horns, and groom them quite regularly. Female Devaronians are covered in thick calico fur that ranges in color from brown to white and are hornless. They are docile, non-aggressive creatures, and tend to dominate their culture. In addition, the teeth of the males are all incisors, but the females also have molars and prominent canines. Devaronians were also one of the first species in the galaxy to develop interstellar travel, and the males of the species have been common sights in spaceports throughout the galaxy for thousands of years. Devaronian males are driven by an urge to wander, usually taking the first opportunity to move on from one place to another. As such, they are often found traveling the galaxy as tramp freighter captains and scouts. Female Devaronians, on the other hand, are content to remain in a single location, and, as such, raise the young and run the government of Devaron. The males send as much money as they can manage back to their home world to support their families, but otherwise hardly ever return once they have begun to travel the stars. The females are content with this arrangement, as they tend to view the restless males as disruptive to home life.",
		"Drach'nam are a very brutal and violent race employing neuronic whips (a whip with a conductive lash which sends hundreds of volts through the victim's body), and long (15 inches) serrated knives. Their home planet is very diverse on the surface ranging from very hot to extremely cold. The planet rotates extremely slowly - one day is about two hundred earth years - so as a result all of the Drach'nam cities are dark tunnels underground.",
		"Draethos are a blue-skinned, humanoid species with large teeth, which dwell outside of their mouths, from the planet Draethos.",
		"Drall are short, squat and stocky bipeds, little more than a meter tall. They are covered with short, thick and dark fur. They have short limbs with clawed and fur-covered hands and feet. Drall are a dignified, self-confident species and are known to be quite level-headed. They primarily live on the planet of Drall, but also inhabit other planets of the Corellian system.",
		"Dressellians are wrinkled humanoids from the planet Dressel. Dressellians believe fiercely in an individuals freedom and will often find it difficult to work in groups, even so many formed a freedom fighting force during the time of the Empire to fight for their right to live as they wanted. Dressilians treasure freedom above everything else. Dressellians use slugthrowers (rifles and pistols firing metal projectiles) instead of blasters.",
		"The Drochs are an insect race from Nam Chorios that start off life as non-sentient but can become sentient by absorbing the life of victims. A droch can burrow under the skin of its intended victim and drink their life while they sleep, or sometimes while they are awake. Their small size, great agility and fast reproductive cycle means that they can wipe out the population of a city in a matter of only a few days. As the drochs drink of sentient victim's life, they also absorb intelligence. Larger, captain drochs can absorb life through the smaller drochs without having to come into contact with the victims themselves. One mutated captain droch, named Dzym, lived to be 250 years old and grew to human size, able to disguise himself as a human and gaining sentience from absorbing intelligence for all that time.",
		"Drovians are a tall and burly species from Nim Drovis with thick trunk-like legs that, like their arms, end in three sharp pincers. The Drovians divided into two tribes, the Gopso'o and the Drovians, centuries ago, and have been at war with each other since. Nearly all Drovians are addicted to a narcotic called zwil; originally imported as a cake flavoring, the Drovians can absorb it directly into their systems through their breathing tubes.",
		"Dugs are slender, powerfully built beings with a somewhat humanoid build and a unique method of walking. Their strong arms are used as legs, and their lower limbs are used as arms. They walk on three powerful fingers. Dugs have smooth skin, which hangs loose around their necks, fin-like ears, and pronounced snouts. Dugs are known for their ill-tempered demeanor, and many are little more than bullying thugs. Diminutive Dugs often feel the need to throw around their strength in bids to establish dominance.",
		"Duloks were a green-colored furry species of Endor and are biologically related to Ewoks, though they tend act more like Tusken raiders of Tatooine.",
		"Duros are hairless beings with blue skin and large red eyes and are said to be among the first spacefaring humanoid species, including humans. They are known for their superior astronavigational skills. Their homeworld is Duro, which is in the galactic core. The Duros haven't set foot on their world since the Empire polluted it with weapons factories. Instead, they live in large orbital cities surrounding the planet. Duros are related to the Neimoidians, the aliens in charge of the Trade Federation in the prequel films, because many years before the Republic, the Duros colonized the planet Neimoidia, and thus the Neimoidians, a newer version of Duros, were born. Ironically, the two relatives differ in personalities: Duros were normally seen as adventurous while Neimoidians were mostly skittish. The Duros consider the Neimoidians to be cowardly and take offense at being mistaken by other beings for a Neimoidian. Duros are also known for their great story-telling skills because of the many places that they have visited during their travels throughout the galaxy. Their planet was remade by the Yuuzhan Vong during the war into a bio-shipyard for the Vong's living creations.",
		"The Echani are a mysterious race of well taught fighters. The Echani race possess natural martial art skill and wear light armor in battle, although they prefer to wear very little when training to restrict their movements less. The Echani maidens were often used to hunt down rogue Jedi and subdue them for the Order. Human in appearance, they often have silver hair and closely resemble their parents, and therefore their siblings. As long as they have the same parents, Echani siblings are identical in appearance. It is known that the Echani held a traditional rivalry with the Mandalorians. Echani and Mandalorians both saw each other as worthy opponents, therefore causing a war between them to prove whose skills were the better. Due to the combat training of the Echani on a daily level, their bones become tougher, making them more durable. Echani were often seen on snowy/cold planets such as Hoth and Eshan. They made their bases underground since they would have been made out of durable materials. Though not much is known about their aging process, it is presumed that they age at a much slower rate than a human. Their life expectancy is around four hundred years.",
		"Native to the planet Elom, members of the Elom species are short and stocky, and are covered with thick, oily hair. They have two tusks covering the opening of their mouth, and have two small eyes set on a pair of stalks protruding from either side of their head. They are also herbivores. Eloms originally developed on the surface of the planet Elom, but were forced to move underground when water became scarce. Since then, they have remained isolated from the rest of the galaxy, with many Eloms continuing to retreat further underground while living there.",
		"The Elomin are tall, demon-like thin humanoids with pointed ears and four horns. They live on the surface of the planet Elom. As a society, the Elomin strove to find order in all things, and worked to create order where it didn't exist. So when they discovered that another species, the Eloms, shared the same planet with them, most Elomin refused to acknowledge that their underground brethren even existed.",
		"The Epicanthix are tall, muscular, near-humans native to the planet Panatha. They were known as warriors, having conquered many bordering planets such as Bunduki. They live longer than humans, with a life-span of around 130 years. They possess a rare genetic immunity to force assisted mental tricks, influence, domination and mind reading. Although Epicanthix appeared very similar to the average human, they were distinct enough that they could be recognized by appearance.",
		"Er'Kit are usually skinny and grayish-blue, with long ears. Er'Kit inhabit the desert planet Er'Kit, for which they were named.",
		"The Evocii are a primitive humanoid race from Nal Hutta, formerly Evocar. When the Hutts arrived on Evocar, the Evocii were amazed by the technology these large, fat slug-like aliens brought with them and began swapping areas of their own home world for the technology that the Hutts had. Soon, they realized that the Hutts owned almost their entire world. Then the Hutts began treating the Evocii like slaves. The Evocii appealed to the Old Republic for help but unfortunately, the laws of the Republic favored the Hutts. The Hutts then brutally relocated the Evocii to Evocar's fifth and largest moon Nar Shaddaa where they were used as slaves to build Nar Shaddaa into a spaceport moon. Most of the Evocii eventually died from the various technologies practiced on that moon while the very few survivors mutated into savages.",
		"Ewoks are a primitive tribal species from the forest moon of Endor. They are approximately half the size of humans and covered with fur. The Ewoks are best known for their aid to the Rebel mission to remove the shield protecting the Second Death Star known as the battle of Endor. While peaceful by nature, they are extremely territorial and have been known to fight ferociously in protection of their society.",
		"The Falleen are a race of human-like reptilian people who come from a world called 'Falleen' in the Midrim region of the galaxy. They can change the color and hue of their skin to convey their emotional states and can also affect the emotional state of others. Males of the race have strong pheromones which can attract women of most species easily. The females have the same talent. The Falleen seldom leave their world due to the belief that their species is superior to all others.",
		"The Feeorins are said to only grow stronger with age. Their homeworld was Odryn, for a period of time in the Old Republic era, when the oldest and strongest Feeorin was chosen as their leader. There are only roughly 1 million Feeorins left in the galaxy, suggesting a decline from a larger number.",
		"Not a well known species, the Ferroans have icy blue skin, whitish hair, and live on Zonama Sekot, a living planet. The planet provides them fleshy habitats constructed of its own mass.",
		"The Firrerreo are a species of near-humans from the planet Firrerre. They have two-toned hair and golden skin. In their culture, if someone says a Firrerreo's name, the Firrerreo would be forced to serve the speaker, as saying a Firrerreo's name was a form of power. They no longer live on Firrerre; after the poisoning of their world by the Empire, they were loaded onto massive colony ships for a journey to another world. They were considered extinct by the Yuuzhan Vong War, but, 15 years later, they were just considered scattered.",
		"The Fosh are a sentient avian species. The Fosh never had a large population on their planet. Fosh females have preternaturally developed tear ducts, used for mating purposes on their homeworld.",
		"The Frozian are a species of sentient felines, hailing from the planet Froz. Their most distinctive characteristics are their triple-jointed hands, their double-jointed legs, and their infertility off of their homeworld. Following the decimation of their planet by the Empire, the species started plummeting towards extinction. It has been rumored that underground scientists have been trying to create an artificial environment for them to save their species and allow mating to begin again.",
		"Frozarns are pink humanoids with green eyes and tough armor. They live on Mimban.",
		"Gados are tall, thin, furry sapients with long limbs and a worm-like head. Most of a Gado's inner organs are stretched out in ribbons that run throughout their body; thus, any injury can be life-threatening to a Gado. Gados are native to the planet of Abregado-rae. They formerly spoke a language called Gados, but now mostly speak Basic.",
		"A Gamorrean is a large pig-like creature that have little intelligence and are often hired as guards, mostly by Jabba the Hutt, who was fond of hiring them due to their low cost. On their home planet, Gamorreans exist in a sort of tribal political system dominated by the female sows. The males train for massive tribal conflicts that take place each year. The first time a vessel landed on Gamorr, the various tribes fought for days over who would win the right to approach it. The winning side eventually battered the vessel to pieces. Entries regarding the Gamorrean homeworld in travel guides simply read 'DO NOT GO TO GAMORR!' Physically, Gamorreans appear as greenish, slimy (and apparently smelly) pig-like creatures. They are about 1.8 metres (6 ft) tall and weigh about 100 kilograms (220 lb). Underneath their pig-like snouts, protruding from jowled cheeks are yellowed tusks. These complement the small, yellow horns the Gamorreans have growing from the top of their heads. They can be best described closest to pigs with their mouths and grunting kind of language.",
		"Gands are insectoids who evolved on the planet Gand. There are two main sub-species of Gands: those with lungs, which are very rare, and those without. Gands with lungs are adapted to Gand's ammonia-rich atmosphere, but they are poisoned by oxygen and must use a special breathing apparatus if they want to leave Gand. Gands without lungs have special regeneration properties, demonstrated by their ability to recover quickly from injuries and even re-grow lost limbs. Gands are not allowed to use personal pronouns unless they have achieved something extraordinary. A young or under achieving Gand talks about himself or herself in third person and calls themselves 'Gand'. If a Gand achieves something notable, they can use their family's surname, but will still use the third person. A second, more impressive feat allows the heroic Gand to choose a first name for himself. Only the best-known Gands are allowed to use the first person, and then only after their aptitude has been audited by a jury, in what is called a janwuine-jika, after which they are declared janwuine. However, should a Gand be ashamed of their deeds, they would 'reduce' their name when talking about themselves. Many Gands choose a strange profession, the Findsman. A Findsman is a shaman as well as a police officer. The Findsman will interpret the shapes of gases and make prophecies, usually about fugitives. Then, the Findsman will track the fugitive to bring him to justice. During the reign of the Empire, some Findsmen became bounty hunters.",
		"Also known as 'Gank Killers' due to their volatile nature, Ganks are a sentient cyborg species. It is a rare to see a Gank not wearing his body-covering armor. Many are found working for Hutts on Nar Shaddaa, but there are other Ganks living in other places besides 'The Smuggler's Moon'. It is also quite common for Ganks to wear armor that represents the planet they live on or the faction they fight for. They are brutal killers that will annihilate anything that gets in their way.",
		"The Gen'Dai are encased in heavy armor most of the time, which serves as their exoskeleton. Their nervous and circulatory systems make them extremely resilient. Their nervous system is composed of thousands of clusters allowing them to regenerate limbs and pull nearby limbs back onto their bodies. This unusual nervous system gives them Jedi-like reflexes. They also lack a central heart. They have an advanced vascular system that circulates blood. They lack vital organs making them nearly invulnerable to attack. These odd nervous and circulatory systems may be the cause of their astonishingly long lifespans. There were some Gen'Dai reported to have lived for more than 4000 years.",
		"Gerbs are a race of hunchbacked rabbit-like aliens. They live on the thirteenth moon of Yavin.",
		"The Geonosians are an insectoid species native to the planet Geonosis, a barren rocky world that is home to thousands of factories geared towards mechanical construction. Many of the Galaxy's biggest manufacturing concerns hold contracts with the Geonosians. Geonosians reside in hive colonies in organic-looking spires. All Geonosians have a hard exoskeleton, elongated faces, multi-jointed limbs, and speak in a strange clicking language. In Geonosian society, there are two main types of Geonosian: the wingless drones that mostly work as laborers, and the winged aristocrat, which includes royal warriors serving as scouts and providing security to the hive. They look down on their wingless cousins. Geonosians do not have a standing military, although they do arm themselves with sonic blasters and static pikes. They instead use their droid foundries to build armies for corporate interests wealthy enough to afford them like the Trade Federation and the Techno Union. The Geonosians are also the ones who developed the Death Star plans, leading to the race being mostly enslaved under Imperial occupancy as the Death Star itself was being built. However, the Geonosians were nearly driven to extinction by the Empire to ensure the secrecy of the Death Star as it was nearing completion and moved to an disclosed location.",
		"The Givin are from the planet Yag'Dhul and are often found doing starship repair work because of their exoskeleton, which allows them to withstand depressurization; this vacuum-resistance allows them to resist many forms of deadly gases. Givin are renowned for their extensive knowledge of anything that has to do with numbers, and often are regarded as some of the best mathematicians in the galaxy.",
		"Gizka is a species of small amphibious creatures. Whatever their native world, their extraordinary reproduction rate led to a fair amount of Gizka on many worlds, even including uncharted planets such as Rakata Prime, finding their way from the wreckage of crashed starships. It has been alternatively postulated that they came from that planet originally, spreading along with the Infinite Empire. Their exponential population growth led to them being considered pests on almost as many worlds as they inhabited.",
		"The Glymphid are a race of amphibian aliens with a rod-thin build, suction cup-tipped digits, and a long proboscis.",
		"The Goraxes are a race of behemoths from the forest moon of Endor. They can grow up to more than 30 meters in height and dwell on high crags far from the forests of the forest moon. They are humanoid, with primate-like faces and narrow chins, as well as enormous ears which are highly sensitive to noises made by small animals. They communicate through grumbling noises. The Goraxes wear fur clothes. They are primitive and powerful and frequently make raids on Ewok villages, where they smash through walls and kidnap Ewoks for pets, although the Goraxes usually forget to feed them or crush the unfortunate Ewoks. They hunt at night, since their eyes are sensitive to bright light.",
		"The Gorith are a tall humanoid race with a large beaked head. Their skin tone ranges from blues to greens. Their home planet is Gorithia; a mostly aquatic world. They are very independent from the rest of the universe and are not part of the Galactic Republic.",
		"The Gorog (or the 'Dark Nest') are one of the eleven hives of the Killik who are an insectoid sentient species from the Unknown Regions.They have the ability to block themselves from the force, similar to the effect of the Ysalamiri of Myrkr and are a black and blue color. The Gorog are considered 'evil' in that they feed their grubs on live captives (mainly Chiss) and have a desire for war and wish to conquer the galaxy.",
		"The Gossam are a humanoid race with long necks from the planet Castell.",
		"Gotals evolved in dark Antar 4. As light is not available there, they evolved cranial cones, receptors to electromagnetism and other emissions. They do not rely on sight, but they can be great trackers thanks to their cones. However, natural emissions from a droid or a Jedi do damage Gotals. Culturally, they only seem to be attracted to other creatures with cones or horns. This has led to many unfortunate deaths as many male Gotals will be attracted to females of the H'nemethe species who tend to disembowel their mates.",
		"The Gran (also known as Kinyenians) are a three-eyed alien race, 1.5 to 1.8 meters in height. They are native to the planet Kinyen, though they have colonies across the galaxy, such as on the planets Hok and Malastare. They are characterized by three eyes on stalks, a protruding, goat-like mouth, and orange skin.",
		"The Gree were a six-tentacled race of cephalopod creatures that had an unusual anatomy with gray skin, large sad-looking eyes along with tall foreheads. These features supported an immense brain sac which flopped oddly behind their heads.",
		"The Grizmallt are the original settlers of Naboo. The Naboo's history begins about 3950 BBY on the planet Grizmallt with the rise of Queen Elsinor den Tasia. To begin her reign, Tasia introduced a new age of exploration and colonization. Under her rule, Grizmallt spent the next several decades launching hundreds of expeditions into the wilds of space. Most of these missions failed, the colony ships destroyed or lost as they searched for habitable worlds far beyond the known hyperlanes. In approximately 3900 BBY (Before the Battle of Yavin), the Grizmallt colonists crash landed on Naboo to stay. Within weeks of their arrival, the settlers encountered the Gungans, the planet's native sentient species. Although immediately distrustful of one another, neither species attacked the other and the humans were allowed to establish their first settlement without incident. Over the next several decades, the settlers slowly spread across the planet's largest landmass, building cities and villages to support their growing numbers. The human colonists kept to the grassy plains and ocean coastlines, only occasionally treading into Gungan territory. Despite this, tension between the humans and the Gungans remained strong. Gungans named the human sellers as 'Naboo' , the Gungan word for 'foolish' or 'plainsfolk'.",
		"The Gungans, also known as Goongas, have humanoid amphibious bodies, but their heads are elongated with large, dangling fin-like ears. They are amphibian in blood and seem to have evolved from frogs and toads, given their incredible jumping. They live in underwater cities on the planet Naboo.",
		"The Gwurran of Ansion look like the native Ansionians, only smaller. They are hyperactive, inquisitive beings who live primitively off the land and who steal the food of travellers passing through the hills. The Gwurran deeply hate their taller rural brethren, the Alwari, who consider them to be backward.",
		"The Habassa originate from the planet Habassa II which was enslaved by the Empire. After the Battle of Yavin, they joined the Alliance.",
		"The Hallotans are scaly creatures who are native to the planet Muskree. They have turned Muskree into an industrial planet and are immune to the pollutions they have created.",
		"The Hapans are the people of the Hapes Cluster and the Hapes Consortium. The Hapes Cluster is very bright, so Hapans' vision at night is not as good as other humans. Though similar to humans, they are known for being beautiful, especially the women. The women are also the dominant sex. Hapans speak the Hapan language.",
		"The Harch were sentient spider-like species from Secundus Ando.",
		"Herglics were a cetacean-like species similar to whaladons. They originated from Giju.",
		"The Himorans share an ancient lineage with Bothans, thus are similar in appearance, though significantly taller. Hailing from the massive planet Himora, these sentients are a primitive people, their homeworld having been long neglected by larger existing governments. Himorans are exceptional in that their population contains an unusually large number of Force-sensitive individuals, expected to number more than 7000.",
		"H'nemtheans are reptilian humanoids, from the planet H'nemthe, have four conelets and double cheekbones, resulting in ridges of bone and skin on their faces. The hornlets are sensitive to both emotion and temperature. When a female H'nemthe consummates her relationship with a male, she eviscerates him with her knife-shaped tongue, strangely considering it a proof of love. This odd ritual is most likely a result of the fact that there are 20 males to every female on their home planet.",
		"The Hoojibs are small furry telepathic creatures that are indigenous to Arbra. The Hoojibs allowed the Rebel Alliance to use their planet as a temporary headquarters following the Battle of Hoth.",
		"The Huk were a race of aliens hailing from the planet of the same name. They are an insectoid species and resemble Geonosians. Their planet was in a constant war with the Kaleesh people of the neighboring planet, Kalee, for many years prior to the Clone Wars and the Great Jedi Purge.",
		"Hssiss were large dragon like creatures that appeared on Korriban. Members of this species are shrouded with the dark side and feature large armor plating on the dorsal region. These creatures have a strong connection with the force and an ability to become invisible.",
		"Hutts are a long-lived gastropoid species. They originated on Varl, but now claim Nal Hutta as their homeworld. Hutt are a clan of crime lords that control territory in the outer rim.",
		"The Iktotchi are an alien race located in a remote system in the Expansion Region, next to the Corellian Run, along with neighboring planet Aridus. They have a tough, hairless, and often reddish skin, as well as two downward-sloping horns on the sides of the head. They are often known for their limited abilities in precognition and, because of this trait, can often be found in Jedi Academies.",
		"The Iridonians are humanoids whose most distinctive feature is the array of small horns on top of their heads. Their home planet is Iridonia, though they have established many colonies on planets throughout the galaxy. It is believed that they are among the galaxy's first space-faring people. They have strong willpower and are a stubborn, proud people. By nature, they tend to be independent and fearless, hence have never been a successful venture in the slave trade. Their crown of horns typically grow in at puberty, and are considered secondary sex characteristics. The pattern in which these horns grow differs between Iridonian sub-species. Iridonian skin coloration can range from the rare pure white or pure black, to the more common shades of cream, red, peach, tan, and brown in between. Iridonian skin color is a matter of genetic dominance and recessiveness. Iridonians can be completely bald or fully haired. Again, it is analogous to race/subspecies. Certain horn patterns are linked with certain hair patterns or lack thereof. Hair can be any of the same colors seen in the human species. However, unlike humans, Iridonian males do not have eyebrows and do not grow facial hair. There is also a different pattern of horns for each gender. The horns on the female are more directed to the front of the head, while the most commonly males have them spanned all across the top of their head. Iridonian eye colors are often similar to the eye colors of humans, with blues and browns being the most common. Yellow, purple, red, green, and orange eyes are seen regularly. Iridonians also traditionally have facial tattoos, typically composed of a pattern of thin lines - which is considered the most traditional of Iridonian tattoos. In certain cases these tattoos can be quite elaborate, but most Iridonians tend to be conservative with their designs. It is unclear what these designs signify. They may indicate which family the Iridonian belongs to, where they grew up, or they may well be just a matter of personal preference on the part of the Iridonian. Iridonians are also well known for their skill with technology and highly advanced weaponry.",
		"Ishi Tibs are ecologist aliens from planet Tibrin. They are amphibious with huge eyes and beak-like mouths. They have lungs that double as internal gills, and they require immersion in briny water every 30 hours before their skin dries out. Ishi Tib are patient, thoughtful beings who are not prone to rash acts. Nonetheless, they are fiercely dedicated, completing any task they begin. Ishi Tib are ferocious fighters, especially when cornered. Offworld Ishi Tib are known for their devotion to nature, and for their excellent managerial skills.",
		"Ithorians are a species of intelligent herbivores from the planet Ithor. They are commonly called Hammerheads because of their long, curving neck and T-shaped head. Ithorians have two mouths and glossy, brown flesh. In general, they are devoted environmentalists, staunch herbivores, and complete pacifists. Many have become galactic traders who peacefully travel the stars in giant herd ships. They will only resort to violence if threatened. Because of their mild demeanor, most Ithorians avoided the Galactic Civil War, although a few joined the Rebel Alliance. Ithorians are natives of the planet Ithor, a lush world with sprawling rain forests. The Ithorians worship Mother Jungle and long ago vowed never to desecrate their planet. Once they discovered repulsorlift technology, the Ithorians built expansive herd cities floating in the skies above their home world. The species migrated to these platforms, ensuring that Ithor would remain pristine forever. Abroad, Ithorians have integrated well with the intergalactic community. Their own language is difficult for non-Ithorians to learn, as the Ithorians have twin mouths on opposite sides of their necks. However, they are able speak Basic, albeit with an accent. Their vocal cords are strong enough to produce a sound shockwave used in defense to stop an enemy in its tracks.",
		"The Jabiimas are native to the planet Jabiim, and were neutral in the Clone Wars until the CIS attacked and destroyed many of their mountaintop Citadels and captured and relocated to hidden caverns inside the mountains. During the Republic's recapturing, many of them were forced into slave camps, but were freed at the last moment by the 501st Legion.",
		"The Jawas are a pygmy rodent-like race inhabiting the desert planet of Tatooine. They are hardworking people who work as scavengers and tinkers, picking up discarded or broken machinery and fixing it up for sale. Being bald and pale, they are entirely covered in red or brown cloaks and their glowing yellow eyes are the only body parts visible. For transport on the desert world, they use long-abandoned mining sandcrawlers. These lumbering giants can house a family unit as well as store cargo that they have collected on their journeys. Jawas belong to clans. Half of the clan works in the sandcrawlers, while the other half lives in desert fortresses made from wrecked spaceships for protection against Tusken Raiders and krayt dragons. They also serve as a home for the rest of the Jawa clan which store the wealth gathered by the other family unit in the sandcrawlers. They are usually 1m to 1.5m tall (between three and five feet).",
		"The Kaleesh are a nomadic and politically neutral race from the planet Kalee. A bipedal reptilian species, the Kaleesh have reddish brown scaly skin and cover almost all their bodies to protect them from Kalee's blistering sun, usually leaving only their four-fingered claws exposed. Most wear masks carved from the skulls of their most feared creatures such as the karabac and the mumuu.",
		"Kaminoans are tall, thin aliens with pale skin from the isolated planet of Kamino; the most distinctive feature are their long necks. Males also have a ridge along the back of their heads. They like to be isolated from the galaxy. Kaminoans were forced to reproduce through cloning after a natural disaster on Kamino. They work creating and training clones for third parties from stations on massive platforms above the sea. Kaminoans seem to be unconcerned about the ethics of their workings. Darth Tyranus (Count Dooku) erased all traces of planet Kamino from the Jedi archives. Kaminoans were able to see colors in the ultraviolet and the infrared spectrum. While to Human eyes the halls of the Kaminoan cities were spotless white, to the Kaminoans they were vividly colored.",
		"The Karkarodon were a race of shark-like sentients from the world of Karkaris.",
		"The Kel Dor, sometimes referred to as Kel Dorians, hail from the technological planet Dorin. They require masks to protect them from oxygen-rich atmospheres and to protect their highly sensitive eyes from light. They are also known for their Force Sages.",
		"The Keshiri are a near-human species from the Wild Space planet of Kesh. The race characteristics include purple or lavender colored skin and hair colors which include silver and white shades.",
		"The Kiffar are a near-human species from the Azurbani system, including Kiffu and Kiffex. The race characteristics seem to include dark, tanned skin and long thick dark hair, usually worn in dreadlocks, and there are certain tattoos that are ceremonial. One in a hundred Kiffar inherits a psychometric talent to read the history of objects that they touch. The Kiffar seem to be clannish and their strongest members compose an order known as the Guardians, which seems to be rather powerful.",
		"Kitonaks (also known as Kirdans) are white, pudgy aliens from Kirdo III. They show a tough skin which folds to seal vulnerable openings, a trait evolved to protect them from the harsh environment of Kirdo's deserts. They also have some double organs, including two pairs of lungs. Kitonaks are very dexterous, but also very patient. They never rush. This is because they feed on animals called choobas and they must stand motionless for a long time until a chooba gets near them. Even when talking with humans or other aliens, Kitonaks are painfully slow to answer any question, and equally slow to walk as they do not move their legs, but expand and contract the muscles of their feet. Kitonak have two toes and three fingers. They eat once a month. They also have a phobia of quicksands and caves.",
		"Klatooinians come from the planet Klatooine. When the Hutts were waging a war against Xim the Despot, they looked for help on some planets. As a result, the Hutts asked the Klatooinians to become part of their army. Since the Klatooinians thought it was some kind of sacred war, their leader Barada M'Beg signed a treaty so that the Klatooinians would be slaves of the Hutts forever. After defeating Xim, Klatooinians remained slaves of the Hutts. Most of their children are named Barada to honor Barada M'Beg.",
		"Kobok were an insectoid species that live on planet Koboth. They have two orange compound eyes and three-fingers.",
		"The Kowakian Monkey-Lizards are a vulturous sentient species from the planet Kowak. They are small, with beak-like mouths and large ears. When born monkey-lizards come out in a larval state. It is a well-known fact that monkey-lizards laugh, a lot. On their home planet their laughter is used to scare predators away, because of how loud they laugh. When in captivity, they are not paired with other species because their laughter is too great and too loud.",
		"The Kubaz are an insect-eating species that have been known to be informants for the Empire. Because of their diet, the insectoid Verpine have a marked distrust of the Kubaz who have often taken great steps to procure Verpine specimens for their suppers.",
		"The Kurtzen are a pale, hairless, humanoid race from Bakura. Being the only native sentient species on Bakura, and few in number, they were quickly outnumbered by human colonists.",
		"Kushiban are small rabbit-like creatures that live on Kushibah in the Star Wars galaxy. Distinguishing features include large black eyes, floppy ears, and a long tail. They are capable of walking on either their hind legs or on all fours, though to move more quickly in a run or a charge, they must run with all four appendages. On their hind legs they stand at 0.5 meters or 1.6404 feet tall, with an extra 0.3 meters' worth of tail. While often mistaken for cute, pet-like animals, they are actually intelligent beings with a complex culture as well as both a written and spoken language. They have mastered fire (used to frighten away hostile, fire-fearing Xinkras) and can use technology. Rather than paws, they have hands with opposable thumbs and feet. As a means of communication, Kushibans' fur changes color in correlation to its mood. A Kushiban in a calm, normal state of emotions is white; a Kushiban in the deepest of despairs is totally black.",
		"The Kwa were an ancient, blue-skinned race that lived on the planet Dathomir. They created the Star Temples and the Infinity Gate on Dathomir around 100,000 BBY. Over time the Kwa sealed their temples and left large wuffa worms to guard them. Nobody really knows what happened to the Kwa, but the ones that were on Dathomir devolved into the primitive Kwi.",
		"A primitive, blue-skinned, saurians species native to Dathomir, the Kwi degenerated from the Kwa, the masterminds behind the Star Temples and Infinity Gate on Dathomir. In 31 BBY, many Kwi were slaughtered by the Nightsisters of Dathomir in an attempt, by the Nightsisters, to unlock the power of the Infinity Gate.",
		"The Kyuzo are a race of humanoid creatures. They have green skin and have masks to filter out moisture.",
		"The Lannik are a race of tan skinned humanoids from a plant of the same name. They have long ears, similar to Yoda's species.",
		"The Lasat are a crafty and sneaky sentient species from Lasan. They are stronger, swifter and stealthier than humans. Their planet is taken over by the Empire who commit a mass genocide on its people.",
		"The Lepi are a rabbit-like species that stand on two legs. Lepi was the Basic name used to describe the Lepus carnivorus, a species of tall, furred lagomorphs which was native to the planet Coachelle Prime. The Lepi were a carnivorous race, distinguished by their large incisors and the various colors of their fur, which ranged from green to dark blue. Despite their appearance, the Lepi were a technologically advanced race, having achieved spaceflight and colonized the five planets in the system and the neighboring asteroid belt. Lepi were considered sexually mature at just ten years of age, and females often gave birth to litters of three dozen or more offspring, resulting in a swift growth in their population. This growth spurred on the development of their space-travel technology, as colony worlds were seen as a response to overpopulation of Coachelle Prime. Individual Lepi were known for their increased metabolism, a trait that often manifested itself as hyper-activity. This was also the native language of the Lepus carnivorus race, which was also referred to as Lepp or Lepese.",
		"The Letaki are a race from the planet Letaki. Letaki have eight tentacles and egg-shaped heads.",
		"The Lurmen (also known as Mygeetans) are a diminutive, pacifistic lemuroid mammalian species native to the crystalline world of Mygeeto and also had a settlement on Maridun. Their bodies were covered entirely in fur, which ranged in color from a dark brown to a white-gray, though they did wear garments. The Lurmen had heads protruding perpendicular from their chest two large golden orange eyes, a nose and a mouth. Each Lurmen had a tail, and they communicated through speech; Lurmen were able to speak Basic. Some Lurmen had the ability to curl up into a ball and roll along the ground. Lurmen were able to cover large amounts of ground at great speed. Most Lurmen were pacifistic by nature and refused to fight or run even in the face of death. They often would hide instead of using violence. As pacifists, they carried no weapons but carried farming tools or ropes.",
		"The Massassi were an ancient primitive warrior race that were enslaved by the Sith. The Massassi were brought to Yavin 4 by the Sith Lord Naga Sadow who was on the run from the Republic and the Jedi. They were originally a red-skinned humanoid race until Naga Sadow conducted cruel genetic experiments on them turning them into a race of fearsome, savage, hunchbacked predators. Despite this cruelty, the Massassi treated Naga Sadow as a god by building huge temples and palaces to honor their Sith Lord. They became extinct when Exar Kun sapped the life out of every Massassi on Yavin 4 so that he could free his soul from his body in order to escape the pursuing Jedi. Only one Massassi, named Kalgrath, survived.",
		"The Melodies are an amphibious, mermaid-like humanoid species that live in Yavin 8's purple mountains, lakes and rivers. Melodies are hatched from eggs, then live on land for a short time during their youth, and at a certain age, Melodies undergo a ritual called a Changing Ceremony, in which they change forms that will no longer enable them to live on land.",
		"An alien species from Circarpous V, the Mimbanites were related to the Coway. When the Empire took control of their planet, they thought this species was not suited for the physical demands of slavery.",
		"An alien race almost exactly the same in appearance as humans, Miraluka differ in that they have no eyes or blank white sockets and cannot see through the focusing of light. Miraluka typically hide their lack of eyes by wearing a headband, a mask, or similar concealing headwear, because they are much less common than humans, and it is easier to travel if they are seen as being of the dominant species; thus the common confusion as to who is or isn't a Miraluka. Miralukas see through the Force, as they are a Force-sensitive race; they are often quite shocked if shown life not connected to the Force. The Miraluka homeworld is Alpheridies. They migrated there after their original homeworld, Katarr, became unstable and began losing its atmosphere to space. Alpheridies' sun emits light in the infra-red spectrum, and this led to the Miraluka losing their ability to see visible light over thousands of generations. Instead, they came to rely on a latent ability to perceive the world through the Force.",
		"The Mirialan race is a species native to the planet Mirial. They have purer eye colors than humans, some have either paler or darker skin colors, and tattoos covering some part of their face that represent individual achievement in some field. They have extrasensory organs on their heads, sensitive to dryness.",
		"The Mon Calamari are an amphibious race from the planet Dac. They are humanoid, about 1.7m tall, and are most commonly seen with salmon-coloured skin (though their skin may have other tones as well, including blue, dark blue, green, and purple) and a squid-like, catfish, domed head with large eyes and webbed hands. With their eyes toward the sides of their heads, they must turn slightly to study visual objects. They are shore dwellers, but like to be close to water, and can breathe under water if necessary, being able to descend to depths of 30 or so metres without equipment. They share their home planet with the Quarren. Their name is a reference to the close resemblance of their heads to calamari (squid). Mon Calamari tend to prefer modern Republic style clothing, while the Quarren wear more traditional robes.",
		"Mustafarians are the native inhabitants of Mustafar. They have leathery skin with a cloak and a trunk. Not much else is known about this species as they live in seclusion. They are believed to be sentient and are able to withstand extreme temperatures. They have saddles for lava fleas and carry defensive laser rifles. As a manhood ritual they leap across water-falls of magma wearing no protection.",
		"A thin, tall species from Muunilinst, Muuns have pasty-white skin. Their bodies were elongated and thin, with equally elongated and thin heads. Muuns do not like travelling, and they usually stay indoors. Muuns are also known for having long life. Muuns controlled the InterGalactic Banking Clan. During the Clone Wars, Muuns helped the Separatists and minted new coins for planets leaving the Republic.",
		"A 4-armed, crystal-skinned alien species indigenous to the planet Wayland.",
		"The Myriad are an ancient race of highly intelligent cybernetic beings. Their true form is not known because the cybernetic implants vary. Their home world is the planet Trieron They have no affiliation with any one group, but serve all races.",
		"The Nagai are aliens with pale skin, jet-black hair and angular features, they lived on the planet Nagi, beyond the borders of the Old Republic and the Empire. They were originally known as 'Knives'. They were natural enemies of the Tof, usually waging wars against them. They are habitually forgetful, particularly regarding things that pertain to annual events.",
		"Nautolans are amphibious humanoids with a range of skin colours from greens to blues and greys, a cartilage-reinforced skeleton, and shark-like eyes. Instead of hair, a Nautolan sports a crown of long tendrils, 14 to be exact (used to discern the feelings and moods of those around them. These appendages are almost useless out of water unless, like Kit Fisto, said Nautolan is used to environmental change). Their homeworld is Glee Anselm, a planet of vast swamps, lakes, and seas located in the Mid Rim. However, Nuatolans are relatively common at any space port. Nautolans reflect the moods of those around them. When confronted by anger and violence, they respond in kind. When approached in a calm, civilized manner, they seem helpful and polite.",
		"Neimoidians are descendants of Duro colonists that landed on Neimoidia in the year of the Republic inception. At some point in their development, the Neimoidians learned to domesticate giant beetles, and they have been getting others to do physical labor for them ever since as stated in Labyrinth of Evil. By the time of The Phantom Menace, the Neimoidians control the galaxy's largest commercial corporation and are at the head of the powerful Trade Federation. Neimoidians are born as grubs and placed in communal hives until the age of seven. Inadequate food is fed to young Neimoidians in order to encourage acquisitiveness. Those who hoard enough food survive while those who do not hoard die. Even as adults, Neimoidians tend to be greedy, possessive, and fearful of death. Eventually, the grubs learn that to survive, they must kill each other; therefore out of the many grubs that are born, very few survive. Neimoidians have been stereotyped by other races in the galaxy as corrupt and greedy, particularly after the Battle of Naboo. They are certainly willing to resort to extortion, lies and manipulation, but their success also lies in exceptional organizational abilities. Training in organization revolves around Neimoidia's mass hives and huge fungus farms. Neimoidian young are placed in a community hive where they are forced to combat their siblings for food and other necessities. The weak die, since the strong hoard food and resources. This is said to be the source of their characteristic greed and corrupt nature. The Neimoidians do not view themselves as wicked, but rather focused on being the best they can be in their society. The Trade Federation army is employed only when future customers do not realize their best interest in trading with Neimoidians, on Neimoidian terms.",
		"The Nelvaanian are canine-muzzled humanoids that live on the planet Nelvaan on the Outer Rim. All of their warrior braves were captured by Techno-Union scientists and were physically and mentally mutated into large bear-like creatures with their left arms replaced with laser cannons, to try to create perfect cyborg soldiers for the CIS.",
		"The Neti were a race of tree-like beings from Rykk.",
		"The Nikto people are a humanoid species from the planet Kintan who have scaly skin, black eyes, and symmetrical horns and spikes on their faces. Subspecies include Green Nikto (Kadas'sa'Nikto) and Red Nikto (Kajain'sa'Nikto). The bombardment of Kintan by stellar radiation from the explosion of a nearby star had sparked rapid evolution in its native species. For several centuries, the Niktos were ruled over by a violent and fanatical religious organization called the Cult of M'dweshuu, which was much despised by the majority of Kintan's population. When the Hutts were waging a war against Xim the Despot, they saw the Niktos' situation as an opportunity to recruit another servant species into their army. A fleet of Huttese starships bombarded the Cult of M'dweshuu's stronghold from orbit, wiping it out, and the grateful Niktos eagerly signed the Treaty of Vontor, placing themselves in servitude to the Hutts indefinitely.",
		"The Noghri are a primitive humanoid species with steely gray skin. They are extremely skilled assassins due to their innate abilities at stealth and hand-to-hand combat. Like the Wookiees, they respect honor above all else. The Noghri are natives of the planet Honoghr, which was ravaged by toxins from a Trade Federation core ship destroyed in battle during the Clone Wars.",
		"Nosaurians are reptilian creatures that have spikes on their head and beaklike mouths.",
		"The Ogemite are a near-Human avian race native to the planet Ogem. They have yellow skin and short, blond, feather-like hair, similar to the Omwati.",
		"Although the Omwati are not a branch of humanity, the differences are extremely small. The Omwati skin is a bluish color and their eyes are generally blue or black. The size of an adult Omwati borders that of a human, although their morphology is typically slightly frailer with regard to females. There are very few Omwati with a stout physiology. Their most striking characteristic is their hair which appears to be made of small, diaphanous feathers of an iridescent color. Omwati do not have any other hair.",
		"The Ongree are a bizarre looking species from the Skustell Cluster.",
		"The Ortolans are a race of fat blue-skinned creatures with long snouts, not all that different from a small elephant. Possessing a love of food and music, these small aliens are also adept at surviving the frigid temperatures of their homeworld Orto.",
		"Oswaft are large manta-ray like creatures that were encountered by Lando Calrissian during his early adventures in the Outer Rim. They live in a nebula called ThonBoka where they are nourished by nutrients from their sun. They live in the vacuum of space and have the unusual ability to travel through hyperspace for short distances. If an Oswaft is deprived of nutrients from a star for too long it will turn opaque and die. They can also subsist on the waste products of spaceships such as the Millennium Falcon and produce waste in the form of valuable minerals.",
		"In Galactic Basic, the Paaerduag is an individual formed by two symbiotic races that are joined as one. However, two voices create the actual name of their race, and four ears hear the true sound of it. The larger, more mobile, aspect of the Paaerduag looks like a humanoid, with long, slender arms and legs, and a head about as broad as its body, however, its voice is unheard by human ears. The smaller aspect of the Paaerduag rides upon the larger in a backpack, of sorts, facing to the rear, and looks remotely like a humanoid with a slender, almost dog-like face, and two sets of eyes. It is capable of being heard and understood. Instead of referring to itself as 'I' or 'me', it uses the term 'we', instead. Their home is called, in Galactic Basic, Sorjus, a small and unimportant world far off the Perlemian trade route, and has an apparently rather temperate climate (as noted from Mic'Tunan'Jus's complaints about Tattooine's climate being far too dry, and the dust is rough on their hide). They begin life as individuals, however, at the age of choosing, they become bonded to their other half, and grow together as a single, complete being, sharing their brains, vision, hearing, and speech.",
		"The Pa'lowick are native to the swampy world of Lowick. They have bulbous bodies supported by long, reed-thin legs. A Pa'lowick's eyes are on short stalks that jut from their heads, their mouths are located at the end of a long, thin proboscis. Lowick is not a technologically advanced world, and most Pa'lowick do not leave. Other species travel to Lowick to mine the rare and beautiful Lowickian firegems.",
		"Pau'ans were gaunt near-Humans native to the planet Utapau. Also known as Utapauns and Ancients due to their long lifespans, they co-existed on Utapau with the Utai. The two species got along well, with the lanky Pau'ans assuming leadership roles on the planet. Though some viewed the Pau'ans as frightening, they were friendly, and were more than happy to welcome visitors to their little-known world. Due to Utapau's remoteness in the Outer Rim Territories, the Pau'ans were isolated for most of their history. The Pau'ans opposed the Confederacy with the aid of the Republic, and later opposed the Empire, after Imperials took control of their planet following the Declaration of a New Order. The average member of the sentient near-Human Pau'an, or Utapaun, as they were sometime called, species stood taller than a human, at approximately 1.9 meters. They were bald and their head was striped with furrowed gray skin. Pau'ans weighed seventy kilograms on average. Pau'ans had large, sunken black eyes in red eye sockets and jagged, fang-like teeth used for tearing into raw meat, as they were carnivores. The species had pale, wrinkled skin, due to the fact that they lived in the sinkholes of Utapau, giving them limited access to light. These traits caused some to view them as frightening. However, Pau'ans as a society were generally friendly, and were happy to welcome guests to their often overlooked world. Pau'ans had long lifespans, living up to 700 years, much longer than the Utai, the other species native to Utapau. This earned them the nickname of 'Ancients'. Members of the species were able to see well in darkness. Pau'ans had four fingers and toes, but were more mobile than they appeared. They often wore elaborate clothes intended to heighten their impressive stature. Most Pau'ans spoke both Utapese and Basic. The Pau'ans fulfilled most of the governmental and administrative duties on Utapau, as the Utai did not desire such work, serving as laborers instead. Most Pau'ans served as leaders early in their lives, often managing teams of Utai laborers. This gave them experience that would be used later in their life. Pau'ans were kind leaders, and sympathetic to their subordinates. Despite the many differences between the Pau'ans and the Utai, the two species were able to co-exist peacefully, although inhabitants of the different Utapaun cities often had conflicts due to philosophical differences. Still, these conflicts rarely developed into bloodshed, and it was more common for the cities to ignore each other. Each city had its own culture, and competition was fierce between the groups. However, they were able to cooperate when the situation necessitated it, such as during the Confederate invasion of the planet in 19 BBY. Pau'an society was a blend of a variety of styles and cultures, borne from the ancient merger with the Utai. Built into the sinkhole walls, Pau'an settlements such as the Pau City spaceport were divided into different areas, each a mix of architectural styles and other-worldly design. They liked art, and enjoyed studying sculptures and finding ways to incorporate different artistic styles into their architecture. Pau'ans developed an industrial society, despite their seemingly primitive and natural image, though the Utai were the ones who actually did the hard work. The Utai did not mind, however, and collectively much preferred labor to positions of leadership. They were able to power their city by wind, harnessing it through massive windmills. Over ninety-nine percent of the planet's power came from these windmills. Most Pau'ans rode living beasts like varactyls and dactillions instead of speeders. Each city was controlled by whomever held the title of Master of Port Administration in that city. These administrators were assisted by advisory councils. The Utapauan Committee, which was composed of representatives from the different cities, governed the planet. However, it rarely made crucial decisions, as the cities were able to function on their own most of the time, turning to the Utapauan Security Force when necessary.",
		"The Phlogs are peaceful giants living on planet Genesia. Phlogs were giant sapients. They were used throughout the galaxy as guards, thugs, and gladiators, on planets such as Genesia. One group intended for slavery became stranded on the forest moon of Endor.",
		"Polis Massans are humanoid aliens who inhabit the asteroid colony of Polis Massa in the Subterrel sector. These thin, mute beings lead mining expeditions and medical research on their remote settlement. Polis Massa is actually the largest remnant of their original homeworld, which was fractured by a natural cataclysm. The survivors took up residence there and began mining the asteroid for artifacts from their former civilization. These archaeological digs were in progress for so long that the mining supervisors came to be known as Polis Massans, having adopted the asteroid as their new homeworld. Polis Massans are typically short, thin beings with flat, pale faces and grey hands, each with four long, dexterous fingers. They use sign language and control devices to make their intentions known. To make up for their lack of speech, Polis Massans have mildly telepathic brains and deep-focus eyes, useful for work deep underground. They have osmotic membrane faces and growth-rings circling their wiry bodies. Many Polis Massans are miners, medics, or exobiologists. They tend to wear form-fitting bodysuits fitted with all manner of signaling devices, medical equipment, and utility pouches. Most Polis Massan miners are seasoned spelunkers who dig deep into the core of their asteroid to locate prize artifacts. The exobiologists among them learned the secrets of cloning from the Kaminoans, whom they resemble. They use this knowledge to analyze the artifacts for organic tissue suitable for cloning. They set up a medical facility on the asteroid to investigate their finds. Although they have little contact with humans, Polis Massans are known for their extraordinary medical skills, and are regarded as compassionate beings who understand the value of life.",
		"Porgs are a penguin or puffin-like flightless bird species with facial features of seals, from the planet Ahch-To. Puffins are indigenous to the island of Skellig, which served as the filming location of Ahch-To. As the filmmakers were not allowed to remove the puffins for filming, and it would have been too much effort to erase them digitally, this inspired the idea of porgs. The voices of porgs were created through a mixture of sounds from turkeys, chickens, and doves.",
		"The Priapulin are a caterpillar-like species from the planet Pria. They have extremely flexible bodies, with five knobby notochords arranged along their tubular length. Their eyes are arranged in three pairs, one above the other, along the upper portion of their bodies. Their undersides are covered with thick brushy bristles. Thick flexible spines emerge along the edges of their bodies. They speak by rubbing the bristles in front of their spiracles, or breathing vents, and surprisingly speak clearly. They need to be in water almost all the time and can see in all directions at once.",
		"Psadan is one of the indigenous races of the planet Wayland. Not much else is known about them.",
		"The P'w'ecks are a warm-blooded, dinosaur-like species similar in appearance to the Ssi-Ruuk but with lower intelligence, smaller size, short tails and drooping eyes. The Ssi-Ruuk have dominated the P'w'ecks for thousands of years, enslaving and controlling their lives. They are used as slaves, guards and beasts of burden and perform the lowest jobs in Ssi-Ruuvi society.",
		"Quarrens or Qarrens are a species of aquatic humanoids that share the planet of Mon Calamari with another sentient aquatic species, the Mon Calamari, from which the planet is named. The Quarren are also nicknamed squid head around the galaxy due to their resemblance to cephalopods, which Quarren are actually related to. They are more introverted than their neighbors, preferring the deep water to the surface and rarely inviting guests to their domain. They are humanoids with squid-like heads that vaguely resemble Cthulhu.",
		"A race of sentient vertebrates, related to the Xexto of Troiken, the Quermian are a species native to the planet Quermia. They have two brains (one in the head and another in the chest cavity), a long thin neck, and six spindly limbs. Their sensitive olfactory glands are located in their hands and they are born with a natural talent in telepathy and mind control. Their telepathy is only short range, though. They must be looking at the person in the eye if they are not force sensitive to perform this task.",
		"The Rakata are an amphibian-humanoid species from the planet Lehon. They ruled an 'Infinite Empire' of 500 worlds, several thousand years before the formation of the Republic. They are believed to be responsible for Tatooine's desert climate due to their razing of the planet, and Kashyyyk's lush overgrowth from their terraforming. During the travels of Revan (Knights of the Old Republic), it is discovered that this race went into decline due to the combination of a civil war and genetic plague. It is not known exactly when this happened, but around 30,000 years before their discovery they became extinct. The Rakata also used their technological skills and knowledge to build a massive space station called the Star Forge.",
		"Ranats, known as Con Queecon in their own language, were a species of meter-tall rodents with long, tusk-like incisors jutting from their lower jaws. Though originally from Rydar II, the Ranats there were nearly wiped out by Human colonists in 200 BBY. Three Ranats stowed away on a spice freighter and crash landed on Aralia, where they re-established their species. Ranat tribes lived in large, maze-like tunnel networks, where they raised their young communally and lured intruders into dead ends to be killed. Ranats had simple personalities, showing little evidence of emotion beyond the desire for food. Though almost always hostile toward one another, tribes did cooperate to kill pest-control teams after entrepreneurs arrived on Aralia to turn it into a planetary amusement park. Ranats were omnivores and strongly preferred meat, especially that of Aralia's native robas. Their sharp incisors and claws were useful as both weapons and tunneling tools. Burrowing wore down their teeth but also released hormones that stimulated tooth growth; unchecked, the incisors could reach prodigious lengths, so most Ranats gnawed constantly to keep them filed back. With few exceptions, Ranats stood about a meter high. This small size made them seem innocuous to many who encountered them and belied their power. They had short, well-muscled limbs with four digits on each forepaw and three per hindpaw. All four paws were nimble and capable of fine manipulation. Ranats had short, heavy-duty, retractable claws that, while of limited use in hunting or self-defense, allowed a Ranat to dig through as much as one meter of soil and loose rock in a mere 15 seconds. The Ranat body was tough, wiry, and partially flattened. Exceptional flexibility allowed Ranats to squeeze through small openings that would prove impenetrable to other beings of similar size. Although a typical Ranat had a long, scaly, hairless tail, the rodents were almost entirely covered in fur that ranged from dirty blond to dark reddish or grayish brown. Some Ranats groomed themselves, but for most, the coat was filthy and foul-smelling. Understandably, many non-Ranats considered the species to be visually unappealing. Ranats stooped when they stood and scampered and scurried when they ran. They tended to wear little more clothing than cloth hoods, leather belts, and ornamental tooth bands. However, those Ranats who integrated into galactic society often wore full-length tunics and footwear. The Ranats' eyes, located at the sides of the head, varied in color from beady and black, to red. Their hairless, pink ears were small and round and typically lay flat against the head. A Ranat's long, pointed snout was full of sharp teeth and terminated in a yellowish-white nose surrounded by long, black whiskers. Their senses were acute: they could see in the dark and detect others' moods by scent. Ranats spoke in a voice of squeaks and screeches. A Ranat's bottom two incisors were sharp, pointed, and discolored yellow or brown from tartar and dirt. Gnawing stimulated glands in the Ranat's jaw to produce growth hormones. Unchecked, this caused the incisors to grow up to a centimeter in a standard hour. The only way to counter the growth was to gnaw even more and wear the teeth down. Some members of the species managed to keep these teeth small enough to fit inside the mouth, but others had incisors that poked out and overlapped the upper lip like tusks. Coupled with their sharp teeth and powerful jaws, these incisors gave Ranats a dangerous bite. Ranats were fecund. Females went into heat at least twice each standard year, during which period they mated with as many males as possible. After fertilization, the fetuses gestated for about 120 standard days. The mother then gave birth to a litter of three to six young. The species' signature incisors began to grow in at adolescence. Members of the species were considered adults at three standard years of age, and the average Ranat could expect to live to be 20 standard years old.",
		"Native to the planet Rattatak, the Rattataki were noticeable for their pale white skin color. They developed a violent culture, like fierce combat involving gladiators of their homeworld.",
		"The Rishii are an avian species from the planet Rishii. They have human-like hands at the ends of their wings. They fly at great speeds from cliffs to catch rodents in their talons. Like most avians, the Rishii live in nests built on cliffs. The Rishii are a kind species, but have an ability to mimic other languages, which, at times, is a little annoying to the people they are mimicking.",
		"Rodians are a species of green, antenna-sporting, bug-eyed humanoids from the planet Rodia. The Rodians are born hunters; they killed most of the wildlife and grew restless with the lack of creatures and began to hunt each other in gladiatorial combat, until the Republic found them. Many continued to hunt as bounty hunters.",
		"Roonans are a bulbous-headed, almond-eyed alien species from the planet Roona.",
		"Ruurians are like walking, fuzzy Huttlets.",
		"Ryn are a humanoid race. Their bodies are covered in fur that primarily grows in a short fuzz all around, with the exception of their human-like hair and the human-like mustaches on the men. They also have prehensile tails, excellent for grasping things. The Ryn are are nomadic, with no knowledge of their original homeworld, and are either hated, ignored, or quietly despised in every corner of the galaxy, notably such areas as the Corporate Sector. They are fond of dance, song, and the enjoyment of life. A peculiar habit of theirs is that a Ryn cannot sleep in the same location twice.",
		"The Sanyassan Marauders were a savage group of ape-like reptiloids with gray-green skin originally from the planet Sanyassa that crash landed sometime in the past on the forest moon of Endor. Led by their brutal leader King Terak, they were always searching for a way to get off Endor. However, their ship was beyond repair since they had destroyed it long ago.",
		"Saurin are a priestal species, one of the two inhabitant races of the planet Bimmiel.",
		"Selkath are the native species of the planet Manaan. An aquatic species, they are very good swimmers and have the ability to breathe out of water. They resemble anthropomorphic catfish and have aqua-colored skin. In ancient times, their ancestors were slaves to the Rakata. Their planet has only one city above land, the capital, Ahto City, and it is the position of the Selkath to remain neutral in times of intergalactic conflict. Their laws are very harsh, and it is common for violence or attempts to compromise Manaan's neutrality to be punished by death. But some believed if the Sith won the Jedi Civil War, they would conquer Manaan. So, they made a secret agreement with the Republic to build a facility right at the kolto source. All members of the Selkath race have venom-tipped, retractable claws. Similar to the Wookiees, the use of these claws in any form of combat is considered dishonorable and a sign of madness. A large, female Firaxan Shark, known as the Progenitor, is seen as either a deity, or even an early evolutionary step in the Selkath chain. This belief is similar to that of a mother Earth goddess, or mother 'ocean' goddess in this case.",
		"The Sauvax were a lobster-like sentient species who hail from Leritor.",
		"A furred, burrowing species from the Corellian System, Selonians resemble giant weasels or otters in appearance. Most Selonians are infertile females; one in every 100 is a male, and 5 in 100 are fertile females. Selonians live in clans more akin to insects than mammals, always headed by a female. Although they do possess advanced technology, they usually stay on-planet.",
		"Shawda Ubb are native to the swamp planet Manpha. Shawda Ubb are short and amphibian-like.",
		"A very human-like species of aliens sometimes confused with Clawdites because of their ability to change form.",
		"Colloquially nicknamed 'wolfmen,' the Shistavanen are a lupine race native to Uvena Prime, one of many habitable planets in the Uvena system. Their bodies are covered in dark hair and they have intimidating, glowing red eyes and sharp fangs. They have very well developed senses, making them extremely good hunters. Like the Wookiees, the Shistavanen are naturally well-suited to work as scouts, but unlike the Wookiees, are more commonly employed by the Empire. Shistavenens are a very xenophobic race who do not like outsiders interfering with their business. Most Shistavanens are aggressive to other races but some are less xenophobic and more sociable, although they are a minority.",
		"The Sikans are an alien race native to the planet of Sika.",
		"The Sith (also known as Red Sith during the time of the Old Sith Empire and Sith Purebloods during the time of the resurgent Sith Empire) were the native species of the planet Korriban. They had red skin and tentacle 'beards', and had a natural talent for mastering the Force as well as their magic and alchemy. Naturally cruel and manipulative, the Sith spread throughout the outer rim in the early days of the Old Republic, eventually centering their empire on Korriban. Some time after the Great Schism several refugee Dark Jedi settled on the planet. Amazing the Sith with their mastery of the Force, the fallen Jedi soon elevated themselves to god-like status, becoming the rulers of the Sith. As the centuries passed, interbreeding occurred between the human Dark Jedi and the Sith, creating a half-species with an enormous talent for manipulating the Force. This species, which were also called Sith, had red skin like the original Sith.",
		"The atmosphere in Skako is extremely dense, so Skakoans evolved to survive under great pressures. When a Skakoan leaves Skako, they decompresse and dies in any low-pressure environment. Thus, they wear special protective suits. Very few non-Skakoans have seen a Skakoan without the suit. The Skakoans were relatively unknown in the galaxy, except for their control of the Techno Union, an important union of engineers and scientists.",
		"A very scarce species, Sneevels are medium-sized creatures that have the nose of a pig, fangs, and a werewolf body.",
		"Coming from Cadomai, Snivvians are short humanoids with protruding jaws and short fangs, sometimes called Snaggletooths. Snivvians come from a cold world and have thick skin instead of fur. They are excellent scouts and trackers, and also obsessive artists. Frequently, a Snivvian author will research his or her characters to an extreme level, sometimes with great risk. When twin males are born, one of them is always a psychotic genius, so they try to control their genetics.",
		"A species from Skor II, Squibs are known for collecting knickknacks and for their love of trading/haggling. These fox-like creatures stand about a meter tall, with large, doe-like eyes and short fur ranging from red to blue in color. The Squibs evolved on Skor II, a world blessed with nearly limitless resources. These resources, however, were widely distributed across the planet. Consequently, the Squibs developed a sophisticated system of barter and trade as different Squib tribes exchanged goods with one another. Another interesting evolutionary trait is the Squib fur, which acts as a taste and smell receptor, enables a Squib to examine an object by touching it and rubbing it against his or her fur. Squibs are generally confident, gregarious, and annoyingly curious. They tend to run into a situation to examine virtually anything without any regard to possible danger to themselves. Their fast-paced metabolisms make them a bundle of energy, and they are often regarded as flighty by other beings.",
		"The Ssi-Ruuk are a saurian race that invade from the Unknown Regions of the galaxy. This was around 4 ABY (After the Battle of Yavin), immediately following Return of the Jedi, in the novel The Truce at Bakura. Native to the planet Lwhekk, Ssi-Ruuk are warm-blooded, reptilian beings covered with scales of various colors. Their blunt, oversized heads end with beaked mouths, and their bodies end with muscular tails. They have clawed hands and feet, and strongly-muscled hind legs. Their skin is so thick that it can withstand blaster shots with only minor burns to show for it. They are blind to The Force, and communicate with each other via a complex series of tweets and whistles. They also have scent tongues which they eject from their nostrils. Each hand has three opposable claws. They all have three eyelids. As a rule, the Ssi-ruuk were highly xenophobic, but were more disgusted by other species than afraid of them. Their religion greatly fears death on any planet that has not been 'sanctified.' As a result, they rely on a technology called entechment that involved capturing the life-energy of beings and using them as power sources. Entechment allows them to use unmanned spaceships for the majority of their combat.",
		"The Stereb were a race of primitive, red-skinned near-humans who once inhabited the world of Serocco. The Stereb possessed primitive technology and built many simple cities across their world. They coexisted with the human population of Serocco until their race was completely destroyed by the Mandalorians' nuclear weapons during the Battle of Serocco.",
		"A Sullustan is a native of the Sullust system. They are short, mouse-eared humanoids with large eyes and mouth-folds, known primarily as merchants and engineers. The Sullustans live in vast caves on the planet Sullust. Most Sullustans work for the Sorusuub Corporation. The majority of those that have found their way off-world work as starship crew. They have a reputation for excellence and intuition for piloting, which has mostly been earned through simple hard work, although as a race they possess perfect direction sense and memory thanks to spending their lives inside the pitch black caves and tunnels that run through Sullust. This allows them to remember any paths they have traveled, or maps they have seen, making them excellent navigators.",
		"The Talortai were a mysterious race with both avian and reptilian qualities. They are a sentient species from the planet Talor. The Talortai were known to be Force-sensitive, able to distinguish between the light and dark sides of the Force, in addition to the ability to detect its presence. The Force was a large part of this species' life; however, for unknown reasons, many did not become Jedi or Sith.",
		"The Talz are a furry race with two distinct sets of eyes: one for day vision, and one for night vision. They are generally peaceful and pacifistic creatures, but were forced into slave labor by the Empire.",
		"Tarasin are chameleon-like species that can communicate silently by fluctuating skin color.",
		"The Taung were early people of the capital planet of the galactic republic, Coruscant. They were the early ancestors of the Mando'a speaking Mandalorians. The Mandalorians inhabited Coruscant long before humans did. They battled the Zhell people (former humans) and the Mandalorians were driven out of the planet by a volcanic explosion which created a massive dust cloud.",
		"Tauntaun are camel-like animals that can be tamed by Jedi and ridden on.",
		"The Tchuukthai, also called Wharls, are quadrupedal predators from an undiscovered planet. They are sentient, but most people in the galaxy consider them to be mere legendary beasts. The secretive Tchuukthai do nothing to discourage this belief; if anything, they enhance it with their displays of ferocity. The Tchuukthai are unable to speak Basic, and very few are ever seen off their home planet.",
		"Teeks are rodentlike, simian creatures that live in the forest moon of Endor. They have a reputation of scavenging and stealing from animal nests and Ewok dwellings. Teeks have long, pointed ears, scruffy white fur, and beady black eyes. They communicate by constant chattering. They wear clothes with many belts, pouches and pockets for the things they have managed to steal. They are also distinguished for running at stunning speed, almost moving too fast for the human eye to see.",
		"Teevans are a flexible species. Not much else is known about them.",
		"Terentatek originally evolved on Korriban, where the power and presence of the dark side gradually distorted their shapes and corrupted their minds. Some sources, however, say that they were first created on Yavin 4 by Exar Kun, as one of his experiments in 3,997 BBY. It is possible that terentateks are highly altered rancors undergoing many experiments. Regardless, terentatek's hide was immune to effects of the Force. They became the most dangerous of the creatures bred by the Sith. They were so powerful and dangerous to the Jedi, that they were often dubbed Jedi Killers.",
		"An equine-humanoid species, the Thakwaash reside on the world of Thakwaa. The entire Thakwaash race is afflicted with a form of dissociative identity disorder Each member possesses multiple 'minds'; each of these minds (and associated personalities) controlling a different skill or talent.",
		"Theelin are a humanoid race and individual members have different skin and hair colors.",
		"The Tiss'shar were a Velociraptor-looking sentient species that come from Tiss'sharl.",
		"Thisspiasians are a sentient serpentine species from the planet Thisspias.",
		"The Thrella are an extinct species from Mimban. They were the builders of the Temple of Pomojema.",
		"An extremely rare species from Mimban, this species lives in the southern swamps. Timoliini is known for its filthy eating habits and yellow-green skin. The species communicates by loud, high-pitched squeaks, sometimes as loud as 140 Decibels. Timoliini's live alone, are rarely seen in packs, and are highly anti-social. Little is known of the species.",
		"A race of quadrupedal aliens with delicate, frail arms, they are a distant cousin of the Hutt species. T'landa Til males have developed a genetic ability to attract females of their kind, which as a byproduct produces powerful, addictive physical and mental waves of pleasure in most humanoid races. The Hutts have been known to exploit this ability for the slave trade.",
		"Tog are green-skinned humanoids from planet Tof, beyond the Galactic Rim, they are considered to be devoid of morals, compassion, or patience. They were ruled by monarchs, who usually possessed military experience. They are natural enemies of the Nagai and both species are usually at war.",
		"Togorians are the felinoid inhabitants of Togoria. Most of them over two metres tall, the beings are covered with fur and have long slender muscles. They are described as very tall panther-like creatures. A Togorian male spends most of his time hunting, in pursuit of prey, they are known to use reptilian mosgoths as mounts. Once a year, male Togorians return to their city homes to mate. Female Togorians are famed for their technological proficiency. Male Togorians are often employed as pirates or bounty hunters due to their great size and power. Male Togorians will occasionally scatter crystal fragments in their thick fur, to dazzle their opponents.",
		"The Togruta are species from the planet Shili. They are a humanoid race distinguished by their three, and rarely 4, lekku (similar to those of Twi'leks, and more commonly called 'head tails'), which are striped to help them blend in with their natural surroundings and act as an erogenous zone. Togruta possess a form of passive acoustic echolocation by means of their hollow montrals, which allows them to sense space and the proximity and movement of physical objects around them. Togruta work well in large groups, and individualism is seen as abnormal within their culture.",
		"The Toong are a race of yellowish-skinned bipeds who sport large heads with no neck, gangly limbs and three antennae. They are timid and nervous by nature, and prefer to avoid confrontations.",
		"The Toydarians are short, blue-skinned mammals, with generally fat bodies and trunk-like snouts. According to The Science of Star Wars, their stomachs are full of helium, allowing them to fly when flapping their leathery wings. They have trunks on their faces that rest above their short tusks. A Toydarian's thin legs end in webbed feet and the males of the species usually show sparse whiskers on their chin and throat, giving them an unshaven appearance. They are immune to every mind trick caused by The Force.",
		"Trandoshan are large, carnivorous, reptilian humanoids from the planet Trandosha (or Dosha), they have supersensitive eyes that can see into the infrared range and the ability to regenerate lost limbs. They also shed their skin. The Trandoshans are a warlike species who allied early with the Empire and the Confederacy during the Clone Wars, taking Wookiees as slaves. They are the natural enemies of Wookiees, and both Wookiees and Trandoshans keep each other's dried skins and pelts as prizes. Their world of origin (Trandoshan or Dosha) occupies the same stellar system as Kashyyyk (the Wookiee homeworld), and it is this proximity that is the source of much of their enmity for the Wookiee race. Unconfirmed speculation suggests that the short-lived Trandoshani overcame their natural limitations as tool users and their harsh homeworld environment to achieve limited space flight on their own, only to discover that the only other inhabited world in their system was a lush, verdant, prey-rich paradise filled with long-lived and technologically unsophisticated savages, and that they've never quite gotten over their pique. Trandoshan religion consists mainly of trying to score enough Jagannath points (The name appears to derive from Jagannath, a deity from Vaishnavism), earned through bounty-hunting or slavery-based kills, to appease the main goddess, or Scorekeeper. Thus, many Trandoshans are bounty hunters or slavers, operating both inside and outside the boundaries of the law. They take particular pleasure in skinning Wookiees for their pelts.",
		"An advanced, adventurous feline species, the Trianii inhabit the outermost portion of the Corporate Sector Authority. Trianii have prehensile tails and their more agile figures are perfect for leaping, jumping, and acrobatics. Like most feline species Trianii have excellent balance and eyesight. Their sleek fur comes in a wide range of colors and patterns. Trian, the Trianii homeplanet, and its six colony worlds were the target of an attempted annexation by the Corporate Sector Authority.",
		"The Trogodiles were a race of crocodilian-like species of Rattatak.",
		"A two-headed, four limbed species that inhabit the planet Pollillus. They were discovered shortly before the Battle of Naboo.",
		"The Tunroth are bipedal sentients indigenous to the Jiroch system of the Mid Rim. Towering and physically strong, Tunroth have distinctive elongated heads, a vertical nostril at the top of the skull, and three-digit hands and feet. Widely spaced eyes and sharp horns that line the chin constituted other distinct physical features. The species is renowned throughout the galaxy for their hunting and tracking skills. They have an innate ability to track a quarry, and over time, an elite association known as the Tunroth Hunters came into demand for employment as bounty hunters and big-game hunters. The fact that the Tunroth maintained their use of sacred hunting weapons such as the klirun bow and the kilter staff even after galactic-standard blasters became available to them attested to the religious importance the Tunroth placed on hunter traditions. Each Tunroth community was ruled by the greatest hunter present. Aggressive and hard-working, Tunroth had a tendency to intimidate members of other species.",
		"Normally referred to as Sand People (or Tuskens), these nomadic desert inhabitants on Tatooine roam the Jundland Wastes, where they are often called Tusken Raiders because of their notable attack against the human settlement at Fort Tusken. The Sand People have had a deep hatred for other species. They dress in heavy cloth robes, and have covered their heads with strips of cloth to hold a breath mask and eye protection on. They have learned how to train the banthas (whom they consider to be holy) native to Tatooine as mounts, and a marauding group of Tuskens will ride them single file, to hide their numbers. Each raider works with the same bantha for life. When a raider's mount is killed or dies, the raider is left to wander the desert alone. If the bantha's spirit deems it so, the raider will be befriended by another bantha. Otherwise, the raider will die in the sands. On the other hand, if a Tusken is killed or dies, its bantha is turned out into the desert where it will either die or join a roaming bantha herd. Sand People also consider the very surface of Tatooine to be holy, and will cover themselves completely as to not allow their skin to touch the ground or the sand. Although the Sand People are aggressive and violent by nature, they have deep-seated traditions that they cling to tightly. Young raiders are required to prove their adulthood in various physical activities, the hardest of which is the manhood ritual of hunting down a krayt dragon. While the Sand People have no written language, the most revered member of a Tusken clan is the storyteller. He knows the life-story of every member of his clan, and also knows of the clan's history. The storyteller is required to memorize the histories word-for-word, eliminating any chance for misinterpretation or distortion. Apprentice storytellers often are more hard-pressed to prove themselves than warriors, for a single mistake in reciting the histories means instant death. As violent as their nature is, Sand People stay as far from the moisture farmers as the farmers do them. There are occasional skirmishes with the more outlying settlements.",
		"Twi'leks are humanoids easily distinguished by the twin tenticular appendages that protrude from the back of the head. These prehensile appendages, known as 'head-tails', 'lekku' or 'tchun-tchin,' are advanced organs used for communication and cognitive functions (similar to those of Togrutas). The Twi'lek's name means Twin Lekku. Like humans, Twi'leks vary greatly in appearance and have a wide variety of skin colors including shades of white, blue, green and red. Twi'leks stand between 1.6 and 2.1 meters tall. Twi'leks speak Twi'leki, a language that combines verbal components with subtle head-tail movements. When they wish, they can even communicate in complete secrecy using their versatile head-tails. Young female Twi'leks are graceful and beautiful, and are highly sought as dancers or slaves, often sold by their own family members for profit. Twi'leks are native to mountainous Ryloth in the Outer Rim.",
		"Ubese are humanoid creatures that are primarily called on as mercenaries or bounty hunters. Normally, they are a very aggressive people. The Ubese's home world is unknown, and was supposedly heavily bombarded by Republic warships in ancient times. The Republic attacked in a preemptive strike due to aggressive weapon development programs on Ubese worlds. The bombardments destroyed the weapon stockpiles, destroying Uba I outright and poisoning Uba II, Uba III and Uba V. Only Uba IV remained somewhat viable, although the toxic atmosphere requires that the Ubese wear environment suits outdoors. Ubese tend to be very secretive, associating only within their own circles.",
		"Ugnaughts are a race of workers and scavengers that are short with pig-like faces.",
		"Umbarans reside on the dark world of Umbara deep within the Ghost Nebula. Umbarans have the ability to subtly influence, or control people easily. They also see in ultraviolet spectrums. Umbarans very closely resemble humans, but with pale, bluish skin and colorless eyes.",
		"Unu is the name given to the main nest or hive of Killiks, an all female race of hive mind insectoid amazons.",
		"The Utai are one of the two races native to the planet Utapau. They have long eyestalks, a short body structure, two toes per foot, 4 fingers per hand, and brown eyes that are well adapted to dark conditions. The Utai are also known as Shorts, due to both their short stature and brief lives. They are native to the sinkholes of their home planet, being the first to colonize the walls and crevices. They are primarily working-class people, responsible for large aquaculture plots and domesticating several creatures for use as transports and beasts of burden. Utai society exists side-by-side with that of the gaunt Pau'an. Utai are generally short and chubby. Utai have pale, hairless skin and large, oblong heads. Two glassy black eyes protrude on thick stalks from the Utai's face, which is otherwise unremarkable, aside from a small, puckered mouth. Utai have stubby, four-fingered hands and are capable workers and mechanics. An age ago, the Utai were the sole inhabitants of Utapau's plummeting sinkholes, living in dwellings nestled among the crevices of the rocky walls. A planetary climate change forced Utapau's other primary species, the Pau'ans, to migrate underground. The two species formed a mutually beneficial society, merging their disparate civilizations and generally living in peace. A natural hierarchy formed, with the Pau'ans well placed as the rulers and politicians of the Utapaun cities, while the more hands-on Utai served as labourers and workers. Utai also serve as the keepers of the varactyl - super-fast lizard beasts used as mounts on Utapau - and over the years have learned how to tame the creatures.",
		"This species evolved on the planet of Vaathkree. They seem to be made of stone and metal, but it is only an armor-like covering. They are known for their religion, centered on bartering.",
		"The Vagaari were a humanoid species from the Unknown Regions. They were a race of nomadic conquerors and slavers that ruled a considerable area in the Unknown Regions. They were led by the Miskara, who was probably a chieftain. Their clothing usually included robes of progressively fancy design and large masks intended to compensate for their height. Their government was the Vagaari Empire.",
		"Veknoids, also known as Velkoids, were a species native to the planet Moonus Mandel.",
		"Vella are the amphibious humainoid inhabitants of the planet Velreone.",
		"The Verpine inhabit the Roche asteroid field and run the aerospace engineering company Slayn & Korpil. Verpine are characterized by their bipedal, wingless bodies and their unusual ability to communicate with each other via organic short wave radio transmissions originating from their antenna. They also have vision which enables them to view microscopic fractures and stresses, which is one of the reasons they make excellent mechanic and repair crews. They have an egalitarian, completely democratized society.",
		"The Vodrans are a species of 1.8-meter-tall humanoid reptiles, with tough skin ranging in coloration from olive to brown, and a small frame of spiny horns around their faces. Though warm blooded, they laid reptilian eggs, with an egg clutch typically producing two or three Vodran young. They were native to the planet Vodran on the fringes of the Si'klaata Cluster.",
		"The Vor are a pterosaur-like species that live on the planet Vortex. The Vor tend not to use extreme force when dealing with foreign threats, but instead rely on their superior morality with their strong reason and intellect.",
		"The Voxyn are a reptilian species known for their ferocious defense mechanisms. As well as being extremely agile, they bear poisonous spinal bristles, spit a strong acid (brown in color), and have a screech noted to cause bleeding of the ears in some of the hummanoid characters.",
		"The Vratix are native to the planet of Thyferra. They are essential in the creation of the healing fluid bacta. They perfected the creation of bacta by combining alazhi and kavam. They vastly outnumber the human natives of the planet, but are considered inferior to their corporate counterparts. The Vratix are humanoid insects. They have large, compound eyes, a stalk-like neck, and three pairs of limbs sprouting from a cylindrical thorax and abdomen. The upper set of limbs acts as triple-jointed arms, while the lower two serve as legs. The last set of limbs is well-muscled, and is used in jumping. Most Vratix are grey in colour, with the shades darkening with age. They have a basic form of hive mentality, but are able to function as individuals. They believe that sight and sound are not permanent things, and prefer to touch another being in order to recognize their presence. The Vratix on Thyferra govern themselves through the Ashern Circle. Vratix was also the name given to the native language of the Vratix. It consisted of a series of clicks and high-pitched sounds, which were augmented by changes in skin colour. Because of this combination, no written form of the Vratix language was created, and non-Vratix could only learn to understand - but not speak - the language.",
		"Vulptereen are a stocky race from Vulpter, recognizable by their shovel-like snouts which sported six tusks and a single long feeler.",
		"Vurks are a reptilian humanoid species, with elongated faces, dark eyes, and a sweeping crest extending from their skulls, giving them the appearance of a parasaurolophus. They are native to the remote planet Sembla, a watery world with warm shallow seas, small volcanic islands, and beautiful coral reefs rich in crystals. Vurks are nomadic and they are equally comfortable on both land and water. Though they are very ethical and peaceful they are wrongly considered primitive by the rest of the galaxy because they haven't developed large settlements and technology. This however is due to not needing them and not because of low intelligence level.",
		"Wampas are snow monsters that are predators on Hoth.",
		"The Weequay are a race of humanoid creatures that hail from the planet Sriluur, a harsh desert planet lending to the species' tanned skin tone and rough, sandy, wrinkled skin. Their eyes are dark and slightly recessed into their skull; their hair tied into at least one long braid — a staple characteristic and religious tradition. They are a laconic people, with traditions rooted deeply in their religious beliefs. Much of their culture is structured around the worship of a pantheon of gods, primarily the God of the Moon, Quay. Their cities are built around a temple, known as a thal.",
		"Whaladons were large sentient mammals native on Mon Calamari. They communicated via sing-songs. Poaching of Whaladons was forbidden by Mon Calamari law but they were hunted when the Galactic Empire occupied the planet.",
		"Wharls are another name for the Tchuukthai.",
		"Whiphids (also known as Toolans) are tall, muscled, furred creatures with great tusks from the planet Toola. They are great hunters and they export ice to other planets. They can also go into a coma-like state to heal major wounds. The home planet of the Whiphids is the icy world of Toola in the Outer Rim.",
		"A Wirutid is a hyper-intelligent fungus that evolves into a human form to secure shelter and trap prey.",
		"A commonly misunderstood and mis characterized species, Wol Cabasshites are a unique example of a culture that has advanced to sentience without the need for technology. Their evolved brains are indeed highly intelligent, but with a life cycle so abstract and alien, their musings are often indecipherable. Indeed, studying Wol Cabasshite's philosophy has long been a fashionable pastime of the intellectual elite, with longstanding debates regarding interpretation of the most famous and bizarre of Wol Cabasshite texts. The closest known genetic relative of the very long-lived Wol Cabasshites is a small, non-sentient species of plasma leech parasite whose entire life-cycle occurs on spacecraft where they feed on plasma and other energetic power sources. Millennia of space travel have spread both the non-sentient leech and the Wol Cabasshite throughout the galaxy, far from their homeworld of Wol Cabassh. Wol Cabasshites are remarkably hardy. They can exist in both vacuum and atmosphere, having no respiratory system and a naturally pressurized interior. Wol Cabasshites can tolerate remarkable temperature extremes. With a plasma-rich diet and extraordinarily high metallic content in their blood, Wol Cabasshites exude a magnetic field controlled by certain internal muscles, including their tongues. By shaping and focusing this field, Cabasshites communicate with each other at a range of up to 25 meters. Their language uses phonemic pulses of energy with syntactic contours in the field. Magnetic singing is an important part of Wol Cabasshite cultures. Gifted Wol Cabasshites can use magnetic fields to communicate directly with the neurons of other sentients, though this often requires direct contact. The sometimes unsettling sensation of direct neuron communication with a Wol Cabasshite has spread to rumors that the species can take control of a subject's brain, though that is not the case. The Wol Cabasshite ability to manipulate magnetic fields has resulted in the development of devices by other cultures to assist in communication. Wol Cabasshites can operate devices attuned to their magnetic singing for the purposes of locomotion, communication and even defense, though most don't bother. Most Wol Cabasshites are content to simply sit and contemplate the nature of the universe... and eat. Physiologically, Wol Cabasshites are mostly stomach; they even have two brains, one for digestive tasks and one for cognition. They eat constantly, extracting nutrients and metals from nearly any substance they touch. There are no known substances that are toxic to Wol Cabasshites, though they are susceptible to Brainworm Rot Type A, an airborne virus that affects their cognitive functions. Given the bizarre nature of Wol Cabasshite thought, diagnosis is very difficult. Although Wol Cabasshites reproduce asexually by vomiting out their stomach linings (which become pupal Cabasshite), adults may exchange genetic material during mutual tongue grooming. This results in organisms exhibiting isolated genetic properties of other individuals.",
		"Wookiees are generally peaceful creatures of the forests of Kashyyyk. They have a tribal society governed by a Chieftain. They are very tall, furry and powerful with a humanoid shape. They have extremely sharp rectractable claws, however it is considered a Tribal crime to use claws in combat. Aside from their stature Wookiee have laser crossbows which can also be seen with mounted scopes. They are considered loyal friends, and commit life debts to people who save them.",
		"Woostoids are yellow-skinned humanoids from the planet Woostri. They were targeted during Grand Admiral Thrawn's campaign of galactic conquest. Surprisingly, these aliens held Imperial doctrines as truth.",
		"Wroonians are a blue-skinned humanoid race from the planet Wroona in the Inner Rim.",
		"The X'ting are an insectoid species, native to the planet Cestus, that change gender every three years.",
		"The Xexto are short, (1.30m [4'3] max), have four arms, two legs and long necks. They hail from the planet Troiken.",
		"The Yaka are a race of near-human cyborgs. They were transformed after their home planet was invaded centuries ago by superintelligent inhabitants of Arkania, a neighboring star system. The Arkanians forced the Yakas to undergo surgery in which they implanted cyborg brain enhancers, increasing the species' intelligence to genius level. Thus, the brutish-looking Yakas are much smarter than they appear. A side effect of the implants is a twisted sense of humor that all Yakas possess.",
		"Yevetha are a now extinct or severely endangered skeletal-looking race of humanoids from the planet N'zoth, near the Galactic Core. They were extremely xenophobic, considering all other races to be vermin. The Empire utilized them as shipyard workers and technicians during the Galactic Civil War, primarily because of their perfectionist nature and knack for technology.",
		"Yinchorri were a race of turtle-like sentients from the planet Yinchorr.",
		"The Yuuzhan Vong are an extragalactic, technophobic, fanatically religious species who were intent upon conquering the galaxy. They are both invisible to direct Force sight and unaffected by direct Force powers. The Yuuzhan Vong used biotechnology instead of mechanical technology. They believed that all other races were little more than barbarians who were not fit to live in their presence. Because of this the Vong attempted to conquer the universe with little thought to the damage they were doing to the universe or its inhabitants. The only race the Vong saw as a threat, or as close to a threat as they were willing to believe, were Wookiees. They saw them as fierce warriors and felt that they deserved to live. For this reason, the Vong enslaved Wookiees rather than attempting to destroy them. Their homeworld was at first in a different galaxy and was called Yuuzhan'tar, which was destroyed in the Cremlevian War. Some went to a seed that was produced from the ashes of Yuuzhan'Tar which was first seen by people in the Unknown Regions and was called Zonama Sekot. Others went to Coruscant, which they renamed Yuuzhan'tar.",
		"The Yuvernians are a two-headed, mottled-skinned reptilian horselike race from the planet of Yuvern. They were fairly large beings, 4.8 meters in length, and standing 2.4 meters in height. They had yellow skin with black spots and elongated skulls.",
		"The Yuzzem are a large powerful mammalian species similar to Wookiees. Most were enslaved during the reign of the Empire and taken from their home planet of Ragna III to do hard labor. They appear similar to Wookiees, but appearing more like werewolves. Their similarities to Wookiees have led people to believe the two share a common ancestor, but this has not been confirmed.",
		"The Yuzzums are fur-covered mammals with a wide mouth with protruding teeth on top of their heads and long legs. They are less intelligent than the Ewoks and dwell on the plains of the forest moon Endor. Groups of Yuzzums often hunt in packs through the tall grass of the plains hunting for rodents to eat. They have been exported as pets, but are not very good at it. They have a musical language and some Yuzzums have found employment as singers.",
		"The extremely attractive Zeltrons are a near-human species native to the planet Zeltros. Their skin is bright pink, full red to dark brown, a special pigmentation that develops from a reaction to their sun’s radiation. The Zeltron people have the ability to project powerful pheromones, much like those emitted by Falleen. These can be activated at will and can affect a specific individual or entire groups at the same time. Zeltrons are also empathic, able to sense the feelings of others as well as project their own. For this reason their love and comfort is extremely important to them. Sharing positive emotions is deemed to everyone’s benefit, while sharing negative emotions is not. In accordance with this, Zeltros’ democratic government will go to great lengths to make sure no one on Zeltros is unhappy. Zeltros has had few tyrants or despotic rulers, because they cannot commit atrocities without experiencing another's pain. Zeltros has, however, been invaded twelve times in the past six centuries. But most invaders, because of the Zeltrons’ pheromones, have given up their hostile intentions and joined in the non-stop festivities. Hence, Zeltrons don’t worry about such trivial matters as planetary defenses or military forces. They are able fighters, though, and they stay in peak physical condition at all times. Zeltrons will go to any length to please guests, and they get pleasure from being hospitable. They hold massive celebrations for practically any event. They are also extremely promiscuous, and are extremely proud of their sexual prowess. They consider the concept of monogamy quaint, but unrealistic. Zeltron technology is on par with most space-faring worlds. They possess space travel, advanced agricultural and industrial methods, and excellent knowledge of medicine, particularly antibiotics. Zeltron scientists have provided notable refinements in the fields of science, and created much of the technology for the Pleasure Domes at Hologram Fun World. Zeltron craftsmen are renowned the galaxy over for their erotic sculptures, paintings, and other works of art. Also in high demand on other worlds are Zeltron courtesans, known as criblez, who fulfill any physical desire one may have, without limits. Many crime lords, particularly Hutts, have taken special interest in these Zeltron servants. Because of their popularity, and because they spend their lives pursuing gratification, Zeltrons are quite common in the galaxy, particularly at spaceports, where they can find many prospective mates.",
		"The Zillo Beast was a gargantuan serpentlike creature with a lengthy whip-like tail. At 97 meters tall, the Zillo Beast towered over all species on its native planet of Malastare and was considered at the top of its food chain until its presumed extinction. Its tail contained eight sharp spikes, and the beast itself uniquely possessed a third arm protruding from its back. Its heavy plated armor was invulnerable to explosions, blaster fire, and even lightsaber strikes.",
		"The Zygerrians are a race of feline like bipeds, who are slavers from the planet Zygerria which is governed by queen Miraj Scintel."
	],

	"alienNames": ["Abednedo",
		"Abyssin",
		"Aleena",
		"Amanin",
		"Amaran",
		"Annoo dat Prime",
		"Anomid",
		"Ansionian",
		"Anx",
		"Anzati",
		"Aqualish",
		"Arcona",
		"Argazdan",
		"Arkanian",
		"Aruzan",
		"Askajian",
		"Balosar",
		"Bando Gora",
		"Barabel",
		"Besalisk",
		"Bimm",
		"Bith",
		"Blarina",
		"Blood Carver",
		"Boltrunians",
		"Bothan",
		"Bouncer",
		"Caamasi",
		"Cathar",
		"Celegian",
		"Cerean",
		"Chadra-Fan",
		"Chalactan",
		"Chagrian",
		"Chazrach",
		"Chiss",
		"Chistori",
		"Clawdite",
		"Codru-Ji",
		"Coway",
		"Croke",
		"Dantari",
		"Dashade",
		"Dathomirian",
		"Defel",
		"Devaronian",
		"Drach'nam",
		"Draethos",
		"Drall",
		"Dressellian",
		"Droch",
		"Drovian",
		"Dug",
		"Dulok",
		"Duros",
		"Echani",
		"Elom",
		"Elomin",
		"Epicanthix",
		"Er'Kit",
		"Evocii",
		"Ewok",
		"Falleen",
		"Feeorin",
		"Ferroans",
		"Firrerreo",
		"Fosh",
		"Frozian",
		"Frozarns",
		"Gado",
		"Gamorrean",
		"Gand",
		"Gank",
		"Gen'Dai",
		"Gerb",
		"Geonosian",
		"Givin",
		"Gizka",
		"Glymphid",
		"Gorax",
		"Gorith",
		"Gorog",
		"Gossam",
		"Gotal",
		"Gran",
		"Gree",
		"Grizmallt",
		"Gungan",
		"Gwurran",
		"Habassa",
		"Hallotan",
		"Hapan",
		"Harch",
		"Herglic",
		"Himoran",
		"H'nemthean",
		"Hoojib",
		"Huk",
		"Hssiss",
		"Hutt",
		"Iktotchi",
		"Iridonian",
		"Ishi Tib",
		"Ithorian",
		"Jabiimas",
		"Jawa",
		"Kaleesh",
		"Kaminoan",
		"Karkarodon",
		"Kel Dor",
		"Keshiri",
		"Kiffar",
		"Kitonak",
		"Klatooinian",
		"Kobok",
		"Kowakian Monkey-Lizard",
		"Kubaz",
		"Kurtzen",
		"Kushiban",
		"Kwa",
		"Kwi",
		"Kyuzo",
		"Lannik",
		"Lasat",
		"Lepi",
		"Letaki",
		"Lurmen",
		"Massassi",
		"Melodie",
		"Mimbanite",
		"Miraluka",
		"Mirialan",
		"Mon Calamari",
		"Mustafarian",
		"Muun",
		"Myneyrsh",
		"Myriad",
		"Nagai",
		"Nautolan",
		"Neimoidian",
		"Nelvaanian",
		"Neti",
		"Nikto",
		"Noghri",
		"Nosaurian",
		"Ogemite",
		"Omwati",
		"Ongree",
		"Ortolan",
		"Oswaft",
		"Paaerduag",
		"Pa'lowick",
		"Pau'an",
		"Phlog",
		"Polis Massans",
		"Porgs",
		"Priapulin",
		"Psadan",
		"P'w'eck",
		"Quarren",
		"Quermian",
		"Rakata",
		"Ranat",
		"Rattataki",
		"Rishii",
		"Rodian",
		"Roonan",
		"Ruurian",
		"Ryn",
		"Sanyassan",
		"Saurin",
		"Selkath",
		"Sauvax",
		"Selonian",
		"Shawda Ubb",
		"Shi'ido",
		"Shistavanen",
		"Sikan",
		"Sith",
		"Skakoan",
		"Sneevel",
		"Snivvian",
		"Squib",
		"Ssi-Ruuk",
		"Stereb",
		"Sullustan",
		"Talortai",
		"Talz",
		"Tarasin",
		"Taung",
		"Tauntaun",
		"Tchuukthai",
		"Teek",
		"Teevan",
		"Terentatek",
		"Thakwaash",
		"Theelin",
		"Tiss'shar",
		"Thisspiasian",
		"Thrella",
		"Timoliini",
		"T'landa Til",
		"Tof",
		"Togorian",
		"Togruta",
		"Toong",
		"Toydarian",
		"Trandoshan",
		"Trianii",
		"Trogodile",
		"Troig",
		"Tunroth",
		"Tusken Raider",
		"Twi'lek",
		"Ubese",
		"Ugnaught",
		"Umbaran",
		"Unu",
		"Utai",
		"Vaathkree",
		"Vagaari",
		"Veknoid",
		"Vella",
		"Verpine",
		"Vodran",
		"Vor",
		"Voxyn",
		"Vratix",
		"Vulptereen",
		"Vurk",
		"Wampa",
		"Weequay",
		"Whaladon",
		"Wharl",
		"Whiphid",
		"Wirutid",
		"Wol Cabasshite",
		"Wookiee",
		"Woostoid",
		"Wroonian",
		"X'ting",
		"Xexto",
		"Yaka",
		"Yevetha",
		"Yinchorri",
		"Yuuzhan Vong",
		"Yuvernian",
		"Yuzzem",
		"Yuzzum",
		"Zeltron",
		"Zillo Beast",
		"Zygerrian"
	],

	"alienPictures": ["https://vignette.wikia.nocookie.net/starwars/images/7/74/Crusher_Roodown.jpg/revision/latest?cb=20160227004203",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f8/Myo_portrait.jpg/revision/latest?cb=20161007111331",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e3/Ratts.jpg/revision/latest?cb=20080508150745",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fe/Amani_NEGAS.jpg/revision/latest?cb=20061205184749",
		"https://vignette.wikia.nocookie.net/starwars/images/9/9b/Amaran.jpg/revision/latest?cb=20110705214307",
		"https://vignette.wikia.nocookie.net/starwars/images/3/37/AshaarKhorda.jpg/revision/latest?cb=20071110182143",
		"https://vignette.wikia.nocookie.net/starwars/images/3/39/Anomid_UAA.jpg/revision/latest?cb=20080706102400",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f1/Ansionian.JPG/revision/latest?cb=20051103223811",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c7/Anx_NEGAS.jpg/revision/latest?cb=20061121172239",
		"https://vignette.wikia.nocookie.net/starwars/images/6/66/AnzatNEGAS.jpg/revision/latest?cb=20061204210934",
		"https://vignette.wikia.nocookie.net/starwars/images/4/4b/Aqualish-NEGAS.png/revision/latest?cb=20171218153304",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b6/Arcona_NEGAS.jpg/revision/latest?cb=20090709061553",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a3/Raygar_full_body.jpg/revision/latest?cb=20120115195328",
		"https://vignette.wikia.nocookie.net/starwars/images/7/7e/Arkanians_DoH.png/revision/latest?cb=20170511035627",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6c/Attanni_Mindlink_XWM.png/revision/latest?cb=20161027021603",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c2/AskajianNEGAS.jpg/revision/latest?cb=20100615161829",
		"https://vignette.wikia.nocookie.net/starwars/images/4/41/BalosarFemale.jpg/revision/latest?cb=20091207031926",
		"https://vignette.wikia.nocookie.net/starwars/images/2/2a/Bandogoracaptain.jpg/revision/latest?cb=20090626001027",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c1/BarabelNEGAS.jpg/revision/latest?cb=20091207032006",
		"https://vignette.wikia.nocookie.net/starwars/images/1/1b/BesaliskNEGAS.jpg/revision/latest?cb=20130908201429",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a3/Bimm1.JPG/revision/latest?cb=20060520130416",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c8/Bith_NEGAS.jpg/revision/latest?cb=20090709061620",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f8/Blarina_CT.png/revision/latest?cb=20160509025250",
		"https://vignette.wikia.nocookie.net/starwars/images/3/3e/Bloodcarver-batorine.jpg/revision/latest?cb=20081029155237",
		"https://i.pinimg.com/originals/f0/06/90/f00690c22956c4cd9f9b69f37a6d5ae6.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/0/03/BothanNEGAS.jpg/revision/latest?cb=20061130130400",
		"https://vignette.wikia.nocookie.net/aliens/images/d/df/Bouncer.jpg/revision/latest?cb=20140626024412",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c1/Caamasi_NEGAS.jpg/revision/latest?cb=20061204211433",
		"https://vignette.wikia.nocookie.net/starwars/images/0/08/Cathar_Defender_TCGMaM.png/revision/latest?cb=20170131040819",
		"https://vignette.wikia.nocookie.net/starwars/images/b/bd/Celegian_UAA.jpg/revision/latest?cb=20071029033152",
		"https://vignette.wikia.nocookie.net/starwars/images/a/ae/Cerean_NEGAS.jpg/revision/latest?cb=20100615162146",
		"https://vignette.wikia.nocookie.net/starwars/images/e/ef/Hyperlane_Scout_FDCR.png/revision/latest?cb=20160905061405",
		"https://vignette.wikia.nocookie.net/starwars/images/4/44/Depa.jpg/revision/latest?cb=20100117032946",
		"https://vignette.wikia.nocookie.net/starwars/images/5/5e/ChagrianNEGAS.jpg/revision/latest?cb=20061201134120",
		"https://vignette.wikia.nocookie.net/bloodandhonor/images/1/14/Chazrach.jpg/revision/latest?cb=20120714105951",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6a/Chiss_EtU.png/revision/latest?cb=20160920070012",
		"https://i.pinimg.com/originals/d0/40/9d/d0409db41f9aba52482f3e16ca1ad092.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/3/37/ClawditeNEGAS.jpg/revision/latest?cb=20090709061818",
		"https://vignette.wikia.nocookie.net/starwars/images/3/39/Codru-Ji_UAA.jpg/revision/latest?cb=20061029143637",
		"https://vignette.wikia.nocookie.net/starwars/images/2/21/Coway.jpg/revision/latest?cb=20100505234059",
		"https://vignette.wikia.nocookie.net/starwars/images/3/3a/Lugubraa-tur.jpg/revision/latest?cb=20110111192937",
		"https://vignette.wikia.nocookie.net/starwars/images/2/2a/Dantari.JPG/revision/latest?cb=20060329211734",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e4/Dashade-TOR.jpg/revision/latest?cb=20100528151757",
		"https://vignette.wikia.nocookie.net/starwars/images/4/40/Nightsisters-SWE.jpg/revision/latest?cb=20111005232654",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b6/ArleilSchous.jpg/revision/latest?cb=20080626154133",
		"https://vignette.wikia.nocookie.net/starwars/images/5/55/DevaronianNEGAS.jpg/revision/latest?cb=20100616044458",
		"https://vignette.wikia.nocookie.net/starwars/images/3/3f/Drach%27nam.JPG/revision/latest?cb=20070811045604",
		"https://vignette.wikia.nocookie.net/starwars/images/3/38/Dreathos_KotORCG.jpg/revision/latest?cb=20081012164431",
		"https://vignette.wikia.nocookie.net/starwars/images/c/cd/Drall_Alien_Anthology.jpg/revision/latest?cb=20070528035538",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c8/Dressellians_SoT.png/revision/latest?cb=20170522024410",
		"https://vignette.wikia.nocookie.net/starwars/images/5/59/Droch-wosfg.jpg/revision/latest?cb=20091029202253",
		"https://vignette.wikia.nocookie.net/starwars/images/8/8c/Drovian_OR.jpg/revision/latest?cb=20150803022506",
		"https://vignette.wikia.nocookie.net/aliens/images/3/3a/Dug.jpg/revision/latest?cb=20100302041601",
		"https://vignette.wikia.nocookie.net/starwars/images/9/97/Dulok_from_SWE.png/revision/latest?cb=20090222103226",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d8/Duros_NEGAS.jpg/revision/latest?cb=20120731045921",
		"https://vignette.wikia.nocookie.net/swtor/images/6/61/Brianna.png/revision/latest?cb=20140315230259",
		"https://i.pinimg.com/originals/b0/c6/7d/b0c67db0b82e109bf1ea5c9aa3cf21b4.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/4/45/Elomin-HS5.png/revision/latest?cb=20170121110823",
		"https://vignette.wikia.nocookie.net/starwars/images/8/8f/Yun.jpg/revision/latest?cb=20070125180951",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c1/OdyMandrellFull-SWE.png/revision/latest?cb=20160913020440",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d1/Odeph.png/revision/latest?cb=20150216020932",
		"https://attackofthefanboy.com/wp-content/uploads/2015/05/Star-Wars-7-les-Ewoks-seront-ils-de-la-partie-e1413559540572.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e6/Ziton_Moj.png/revision/latest?cb=20180215055812",
		"https://vignette.wikia.nocookie.net/starwars/images/5/54/Feeorin_KotORCG.jpg/revision/latest?cb=20081230050606",
		"https://vignette.wikia.nocookie.net/starwars/images/6/66/Jabitha_Hal.jpg/revision/latest?cb=20121016091120",
		"https://vignette.wikia.nocookie.net/swgalaxyatwar/images/3/38/Firr.jpg/revision/latest?cb=20100622043321",
		"https://vignette.wikia.nocookie.net/starwars/images/b/be/Fosh_NEGAS.jpg/revision/latest?cb=20061205185736",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f7/Frozians.jpg/revision/latest?cb=20070528032554",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/9/91/Gados.JPG/revision/latest?cb=20060328214151",
		"https://vignette.wikia.nocookie.net/starwars/images/d/df/Gamorrean_NEGAS.jpg/revision/latest?cb=20090709062222",
		"https://vignette.wikia.nocookie.net/starwars/images/9/9a/GandAlienNEGAS.jpg/revision/latest?cb=20061205190815",
		"https://vignette.wikia.nocookie.net/starwars/images/6/68/Gank_LoNH.png/revision/latest/scale-to-width-down/200?cb=20150928004350",
		"https://vignette.wikia.nocookie.net/starwars/images/8/8d/The_Flame.png/revision/latest?cb=20150715213405",
		"https://vignette.wikia.nocookie.net/starwars/images/1/11/Gerbalen.jpg/revision/latest?cb=20060330204211",
		"https://vignette.wikia.nocookie.net/villains/images/6/6d/Geonosian1.jpg/revision/latest?cb=20090613144620",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a5/GivinNEGAS.jpg/revision/latest?cb=20100616171144",
		"https://vignette.wikia.nocookie.net/starwars/images/9/98/CreepyFaceGizka-WotC.jpg/revision/latest?cb=20081214211548",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f0/Aldar_beedo.jpg/revision/latest?cb=20061031103536",
		"https://vignette.wikia.nocookie.net/starwars/images/4/42/Gorax_-_SWGTCG.jpg/revision/latest?cb=20100203015956",
		"http://cdn.obsidianportal.com/assets/126309/Gorith.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/6/66/Starkiller_v_Gorog.png/revision/latest?cb=20130903121445",
		"http://cdn.obsidianportal.com/assets/126311/Gossam.jpg",
		"http://cdn.obsidianportal.com/assets/126313/Gotal.jpg",
		"http://cdn.obsidianportal.com/assets/126314/Gran.JPG",
		"https://vignette.wikia.nocookie.net/starwars/images/4/4b/Gree.png/revision/latest?cb=20150809221523",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/3/31/Gungan_NEGAS.jpg/revision/latest?cb=20070225162243",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/7/73/HapanNonComOfficer-GAW.jpg/revision/latest?cb=20091028132039",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f2/Admiral_Trench.png/revision/latest?cb=20130120145057",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a0/Herglic.JPG/revision/latest?cb=20070528033121",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/0/0f/H%27nemthe_NEGAS.jpg/revision/latest/scale-to-width-down/500?cb=20080526073830",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c2/H00jib.jpg/revision/latest/scale-to-width-down/200?cb=20070324080117",
		"https://vignette.wikia.nocookie.net/starwars/images/d/de/Kitik_Keed%27kak_Hasbro_portrait.jpg/revision/latest/scale-to-width-down/180?cb=20090526121230",
		"https://vignette.wikia.nocookie.net/starwars/images/d/da/HssissKOTORII.jpg/revision/latest?cb=20090511160917",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a7/HuttNEGAS.png/revision/latest?cb=20130115030417",
		"https://vignette.wikia.nocookie.net/starwarsmush/images/b/bf/Alien_snp_Iktotchi.jpg/revision/latest?cb=20090214182705",
		"https://vignette.wikia.nocookie.net/starwars/images/e/ee/KaoCenDarach-Return.png/revision/latest?cb=20121119061953",
		"https://vignette.wikia.nocookie.net/starwars/images/5/5f/Ishi_Tib_NEGAS.jpg/revision/latest?cb=20061205191202",
		"https://vignette.wikia.nocookie.net/aliens/images/0/0f/Ithorian.jpg/revision/latest?cb=20080607194419",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/5/56/Jawas.png/revision/latest?cb=20150728165709",
		"https://i.pinimg.com/originals/93/b3/c7/93b3c76ff81e8b1855d0ca9a0fb8e8d7.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/0/03/KaminoanNEGAS.jpg/revision/latest?cb=20090709062442",
		"https://vignette.wikia.nocookie.net/starwars/images/0/07/RiffTamson-SWE.png/revision/latest?cb=20160913054327",
		"https://vignette.wikia.nocookie.net/starwars/images/2/24/Kel_Dor_NEGAS.jpg/revision/latest?cb=20061130130943",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fb/Keshiri_sailors_LTOTS_1.jpg/revision/latest?cb=20121209224301",
		"https://vignette.wikia.nocookie.net/starwars/images/6/62/QuinlanVos-SWE.png/revision/latest?cb=20160913030038",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c9/Kintonak_NEGAS.jpg/revision/latest?cb=20061202133808",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e4/Klatooinian_NEGAS.jpg/revision/latest?cb=20061205191555",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b4/Kobok.jpg/revision/latest?cb=20071029031333",
		"https://vignette.wikia.nocookie.net/starwars/images/8/86/Kowakian_NEGAS.jpg/revision/latest?cb=20061129193617",
		"https://vignette.wikia.nocookie.net/starwars/images/c/cf/Kubaz_NEGAS.jpg/revision/latest?cb=20061130131415",
		"https://vignette.wikia.nocookie.net/starwars/images/4/40/Kurtzen.png/revision/latest/scale-to-width-down/140?cb=20080305125317",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6a/Kushiban_UAA.jpg/revision/latest?cb=20061105172331",
		"https://vignette.wikia.nocookie.net/starwars/images/0/0b/Kwa1.JPG/revision/latest?cb=20110224232732",
		"https://vignette.wikia.nocookie.net/starwars/images/8/80/Kwi-SWREP24.jpg/revision/latest?cb=20110224233233",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fb/Embo-SWE.png/revision/latest/scale-to-width-down/200?cb=20160910211707",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b6/Lannik_LBE.png/revision/latest?cb=20160923044258",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6d/ZebOrrelios1-Fathead.png/revision/latest?cb=20161110044833",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e9/Jaxxon-gamer.jpg/revision/latest?cb=20061025214956",
		"https://vignette.wikia.nocookie.net/starwars/images/d/dc/Orbus.jpg/revision/latest?cb=20060708043950",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c1/Lurmen-SW_Propaganda.png/revision/latest?cb=20170306053243",
		"https://vignette.wikia.nocookie.net/starwars/images/3/30/Massassi_KotORCG.jpg/revision/latest?cb=20081230050518",
		"https://vignette.wikia.nocookie.net/starwars/images/4/4d/MelodieTEGAS.jpg/revision/latest/scale-to-width-down/200?cb=20120204191544",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b5/Mimb.jpg/revision/latest?cb=20050729155102",
		"https://vignette.wikia.nocookie.net/starwars/images/5/57/Miraluka_UAA.jpg/revision/latest?cb=20061024201734",
		"https://vignette.wikia.nocookie.net/swgalaxyatwar/images/f/fe/Mirialan.jpg/revision/latest?cb=20100627171740",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a9/Hidden_Cache-EoD.jpg/revision/latest?cb=20140128170910",
		"https://vignette.wikia.nocookie.net/aliens/images/3/3c/Mustafarians.jpg/revision/latest?cb=20121217141554",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6f/SanHill_hs.jpg/revision/latest?cb=20080117160044",
		"https://vignette.wikia.nocookie.net/starwars/images/5/57/Myneyrshi2.jpg/revision/latest?cb=20071217202356",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/b/be/Nagai-TURcov.png/revision/latest?cb=20160928061149",
		"https://vignette.wikia.nocookie.net/swfanon/images/f/f8/Nautolan_Sith2.jpg/revision/latest?cb=20110811183538",
		"https://vignette.wikia.nocookie.net/starwars/images/5/52/Neimoidian_NEGAS.jpg/revision/latest?cb=20061021200803",
		"https://vignette.wikia.nocookie.net/starwars/images/e/ea/Nelvaanian_NEGAS.jpg/revision/latest?cb=20061129194111",
		"https://vignette.wikia.nocookie.net/starwars/images/8/89/OodBnar-TSW5.jpg/revision/latest?cb=20080619021635",
		"https://i.pinimg.com/originals/cb/a1/0f/cba10fb70ac62458ce6240960afbe8a6.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/9/90/NoghriNEGAS.jpg/revision/latest?cb=20090709063145",
		"https://vignette.wikia.nocookie.net/starwars/images/a/ab/Nosaurian_NEGAS.jpg/revision/latest?cb=20090709063206",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e6/AnduvilHeadshot.jpg/revision/latest?cb=20131119163136",
		"https://vignette.wikia.nocookie.net/starwars/images/a/af/Qwi.jpg/revision/latest/scale-to-width-down/120?cb=20080930134515",
		"https://vignette.wikia.nocookie.net/starwars/images/c/c7/Ongree_NEGAS.jpg/revision/latest?cb=20100627170639",
		"https://vignette.wikia.nocookie.net/starwars/images/0/08/Ortolan_NEGAS.jpg/revision/latest?cb=20061206183822",
		"https://vignette.wikia.nocookie.net/starwars/images/6/68/Oswaft.jpg/revision/latest?cb=20060311185134",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f5/Ja%27Gatcha1.jpg/revision/latest?cb=20120622202339",
		"https://vignette.wikia.nocookie.net/starwars/images/2/25/Palowick_NEGAS.jpg/revision/latest?cb=20100629031211",
		"https://vignette.wikia.nocookie.net/starwars/images/4/43/Tion_Medon.jpg/revision/latest?cb=20091130182814",
		"https://vignette.wikia.nocookie.net/starwars/images/2/22/Phlogs_Ewoks.jpg/revision/latest/scale-to-width-down/180?cb=20070415082101",
		"https://vignette.wikia.nocookie.net/starwars/images/7/7d/Polis-Massan_NEGAS.jpg/revision/latest?cb=20061129201209",
		"https://www.penguin.com.au/content/9780241281093_3.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/6/69/Priapulin.jpg/revision/latest?cb=20061230045653",
		"https://vignette.wikia.nocookie.net/starwars/images/8/8e/Psadan_UAA.jpg/revision/latest?cb=20061025165500",
		"https://vignette.wikia.nocookie.net/starwars/images/e/ef/Pweck-AE121.png/revision/latest?cb=20070529022514",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a7/Quarren_AoRSR.png/revision/latest?cb=20170420213903",
		"https://vignette.wikia.nocookie.net/starwars/images/9/9a/XextoQuermian.jpg/revision/latest?cb=20100810190143",
		"https://i.pinimg.com/originals/d4/dc/67/d4dc6765775870e73d42cd47695202f5.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/6/65/Possible_Ranat_in_Darth_Maul_2.png/revision/latest?cb=20150620163242",
		"https://i.pinimg.com/originals/be/5e/09/be5e09de03b4def26c307bee5fbbfb36.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/1/1e/Rishii.png/revision/latest?cb=20150810143904",
		"https://vignette.wikia.nocookie.net/starwars/images/2/23/Rodian_NEGAS.jpg/revision/latest?cb=20061127015745",
		"https://vignette.wikia.nocookie.net/starwars/images/9/97/Roonan_Senator.png/revision/latest?cb=20131112111333",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b1/Ruurian_Rabbitte.png/revision/latest?cb=20141211092955",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fe/Ryn_NEGAS.jpg/revision/latest?cb=20061206183948",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d0/Sanyassan_marauder_concept_art.PNG/revision/latest/scale-to-width-down/140?cb=20120519143756",
		"http://3.bp.blogspot.com/-Yfg_10Lqq0k/UYa83JtIFPI/AAAAAAAAEG8/DRsONb9OqE8/s1600/Saurin-3-sm.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e9/Selkath_concept.png/revision/latest?cb=20140618125548",
		"https://vignette.wikia.nocookie.net/starwars/images/1/15/Sauvax.jpg/revision/latest?cb=20060803164852",
		"https://vignette.wikia.nocookie.net/starwars/images/2/21/Selonian_warrior-SoF.jpg/revision/latest?cb=20140426090913",
		"https://vignette.wikia.nocookie.net/starwars/images/7/70/Shawda_Ubb_AE.jpg/revision/latest?cb=20110414054150",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f0/Shi%27ido_UAA.jpg/revision/latest?cb=20061105161505",
		"https://vignette.wikia.nocookie.net/starwars/images/1/11/Shistavanen_NEGAS.jpg/revision/latest?cb=20081029010544",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/3/36/Sek%27nos_Rath.jpg/revision/latest/scale-to-width-down/200?cb=20120104013218",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a0/Skakoan2.jpg/revision/latest?cb=20091012195839",
		"https://vignette.wikia.nocookie.net/starwars/images/a/ae/Boles_Roor_concept_art.jpg/revision/latest?cb=20090425013838",
		"https://vignette.wikia.nocookie.net/starwars/images/0/04/Snivvian.jpg/revision/latest?cb=20051106001730",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e4/Squib_Alien_Anthology.jpg/revision/latest?cb=20070528033813",
		"https://vignette.wikia.nocookie.net/starwars/images/8/8d/SsiruuNEGAS.jpg/revision/latest?cb=20061206184105",
		"https://vignette.wikia.nocookie.net/starwars/images/c/cd/Stereb.jpg/revision/latest?cb=20080113051046",
		"https://vignette.wikia.nocookie.net/starwars/images/f/f5/Sullustan_NEGAS.jpg/revision/latest?cb=20100810063353",
		"https://vignette.wikia.nocookie.net/starwars/images/2/2d/UraiFen3.JPG/revision/latest?cb=20090202182015",
		"https://vignette.wikia.nocookie.net/starwars/images/2/29/Thi-Sen_SWE.png/revision/latest?cb=20151008170903",
		"https://vignette.wikia.nocookie.net/starwarsmush/images/7/70/Alien_snp_Tarasin.jpg/revision/latest?cb=20090214212537",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d2/TaungMartialArtsMaster-GAW.jpg/revision/latest?cb=20091027133239",
		"https://vignette.wikia.nocookie.net/starwars/images/6/62/Tauntaun_NEGAS.jpg/revision/latest?cb=20100810065543",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a1/Tchuukthai.jpg/revision/latest?cb=20060821231655",
		"https://vignette.wikia.nocookie.net/starwars/images/5/57/The_Teek.jpg/revision/latest?cb=20071007182828",
		"https://vignette.wikia.nocookie.net/starwars/images/1/1c/TruVeld.jpg/revision/latest?cb=20070415171418",
		"https://vignette.wikia.nocookie.net/starwars/images/2/28/Terentatek_TOR.jpg/revision/latest?cb=20081022180956",
		"https://vignette.wikia.nocookie.net/starwars/images/5/5f/Thakwaash-GAW.jpg/revision/latest?cb=20091027140211",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b6/LattsRazziDetail-SWE.png/revision/latest?cb=20160912043402",
		"https://vignette.wikia.nocookie.net/aliens/images/0/04/Tiss%27shar.jpg/revision/latest?cb=20160304144037",
		"https://vignette.wikia.nocookie.net/starwars/images/4/42/Thisspian_NEGAS.jpg/revision/latest?cb=20090709064201",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.pn",
		"https://vignette.wikia.nocookie.net/starwars/images/7/76/Tlanda_Til_LoNH.png/revision/latest?cb=20150916032727",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b3/Tofs_ahoy.jpg/revision/latest?cb=20130130134153",
		"https://vignette.wikia.nocookie.net/starwars/images/1/18/Togorian_head.jpg/revision/latest?cb=20090421075051",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b2/Togruta_NEGAS.jpg/revision/latest?cb=20100810070146",
		"https://vignette.wikia.nocookie.net/starwars/images/1/18/BenQuadinarosFull-SWE.png/revision/latest?cb=20160910192602",
		"https://vignette.wikia.nocookie.net/starwars/images/9/9a/Toydarian_EtU.png/revision/latest?cb=20160920122918",
		"https://vignette.wikia.nocookie.net/starwars/images/4/45/Trandoshan_NEGAS.png/revision/latest?cb=20130115031110",
		"https://vignette.wikia.nocookie.net/starwars/images/5/54/Trianii_UAA.jpg/revision/latest?cb=20061026214318",
		"https://vignette.wikia.nocookie.net/starwars/images/9/9f/Trog.JPG/revision/latest?cb=20150719211027",
		"https://vignette.wikia.nocookie.net/starwars/images/3/38/Troig_full_body.jpg/revision/latest?cb=20110606225145",
		"https://vignette.wikia.nocookie.net/starwars/images/e/ec/Tunroth_head.jpg/revision/latest?cb=20070221220023",
		"https://upload.wikimedia.org/wikipedia/en/thumb/3/3e/Tuskenraider.jpg/250px-Tuskenraider.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/9/95/TwilekNEGAS.png/revision/latest?cb=20150523023715",
		"https://vignette.wikia.nocookie.net/starwars/images/6/64/Liash_Keane.jpg/revision/latest?cb=20090506121423",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a8/Ugnaught_NEGAS.jpg/revision/latest?cb=20061206184530",
		"https://vignette.wikia.nocookie.net/starwarsmush/images/4/4c/Alien_snp_Umbaran.jpg/revision/latest?cb=20090214220234",
		"http://cdn.obsidianportal.com/assets/126509/Killiks.jpg",
		"https://vignette.wikia.nocookie.net/aliens/images/2/2e/Utai.jpg/revision/latest?cb=20091015011857",
		"https://vignette.wikia.nocookie.net/starwars/images/4/4b/Valka.jpg/revision/latest?cb=20060415114655",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d7/Vagaari-tur.jpg/revision/latest?cb=20100426214804",
		"https://vignette.wikia.nocookie.net/starwars/images/6/62/Zao-DTFC1.jpg/revision/latest?cb=20130623024526",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/5/54/Verpine_AoRSR.png/revision/latest?cb=20170326011634",
		"https://vignette.wikia.nocookie.net/starwars/images/2/21/Vodran_2.jpg/revision/latest?cb=20060611182423",
		"https://vignette.wikia.nocookie.net/starwars/images/e/e6/Aerobat.jpg/revision/latest?cb=20100113191930",
		"https://vignette.wikia.nocookie.net/starwars/images/1/18/Voxyn.jpg/revision/latest?cb=20070620175633",
		"https://vignette.wikia.nocookie.net/starwars/images/5/57/Vratix_UAA.jpg/revision/latest?cb=20061029084819",
		"https://pre00.deviantart.net/828e/th/pre/f/2014/094/6/6/vulptereen_smuggler_by_ryan_rhodes-d7d25gi.png",
		"https://vignette.wikia.nocookie.net/starwars/images/b/ba/ColemanTrebor-TLC.jpg/revision/latest?cb=20130430041040",
		"https://orig00.deviantart.net/fdaa/f/2015/047/3/4/wampa_star_wars_commission_by_carl_riley_art-d8i8ozs.jpg",
		"https://vignette.wikia.nocookie.net/aliens/images/5/5a/Weequay.jpg/revision/latest?cb=20100428011138",
		"https://vignette.wikia.nocookie.net/starwars/images/d/d9/Whaladon3.jpg/revision/latest?cb=20071023021522",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/2/28/Whiphid_NEGAS2.jpg/revision/latest?cb=20101123210609",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/7/76/GhoelJabbasPalace.jpg/revision/latest?cb=20110829042839",
		"https://vignette.wikia.nocookie.net/starwars/images/1/14/Wookiee_NEGAS.jpg/revision/latest?cb=20090711201859",
		"https://vignette.wikia.nocookie.net/starwars/images/4/41/Woostoids.jpg/revision/latest?cb=20071123163657",
		"https://vignette.wikia.nocookie.net/swgalaxyatwar/images/f/f8/Wroonian.jpg/revision/latest?cb=20100627172903",
		"http://www.formica.com/th/~/media/global-images/ui/noimageavailable.png",
		"https://vignette.wikia.nocookie.net/starwars/images/3/30/Gasgano.jpg/revision/latest?cb=20150331133737",
		"http://cdn.obsidianportal.com/assets/126538/Yaka.jpg",
		"https://vignette.wikia.nocookie.net/starwars/images/b/b8/Yevetha_NEGAS.jpg/revision/latest?cb=20061129202342",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fd/Yinchorri.jpg/revision/latest?cb=20060121172921",
		"https://vignette.wikia.nocookie.net/starwars/images/6/6e/YuuzhanVong_NEGAS.jpg/revision/latest?cb=20070617052507",
		"https://vignette.wikia.nocookie.net/starwars/images/5/52/Cane-adiss-2.jpg/revision/latest?cb=20080626151733",
		"https://vignette.wikia.nocookie.net/starwars/images/c/cc/Yuzzem-GAW.jpg/revision/latest?cb=20091027125655",
		"https://vignette.wikia.nocookie.net/starwars/images/a/a1/Yowza_Jedi_Rocks.png/revision/latest?cb=20131030230920",
		"https://vignette.wikia.nocookie.net/starwars/images/4/44/Zeltron_Female.jpg/revision/latest?cb=20090601102211",
		"https://vignette.wikia.nocookie.net/starwars/images/f/fb/ZilloBeast-SW.png/revision/latest?cb=20140907224250",
		"https://vignette.wikia.nocookie.net/starwars/images/5/5b/Zygerrians-SWE.png/revision/latest?cb=20160914024800"]

}